ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/**
******************************************************************************
* @file     adpd400x_reg.h
* @author   ADI
* @version  V0.1
* @date     30-Jan-2019
* @brief    Include file for the ADPD400x device driver
******************************************************************************
* @attention
******************************************************************************
*/
/******************************************************************************
* Copyright (c) 2019 Analog Devices, Inc.  All rights reserved. 
*  
* Redistribution and use in source and binary forms, with or without 
* modification, are permitted provided that the following conditions are met:   
* - Redistributions of source code must retain the above copyright notice, this 
*   list of conditions and the following disclaimer.   
* - Redistributions in binary form must reproduce the above copyright notice, 
*   this list of conditions and the following disclaimer in the documentation 
*   and/or other materials provided with the distribution.     
* - Modified versions of the software must be conspicuously marked as such.   
* - This software is licensed solely and exclusively for use with 
*   processors/products manufactured by or for Analog Devices, Inc.   
* - This software may not be combined or merged with other code in any manner 
*   that would cause the software to become subject to terms and conditions 
*   which differ from those listed here.   
* - Neither the name of Analog Devices, Inc. nor the names of its contributors 
*   may be used to endorse or promote products derived from this software 
*   without specific prior written permission.   
* - The use of this software may or may not infringe the patent rights of one 
*   or more patent holders.  This license does not release you from the 
*   requirement that you obtain separate licenses from these patent holders to 
*   use this software. 
* 
* THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS" 
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, 
* NONINFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
* ARE DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE 
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR 
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF 
* CLAIMS OF INTELLECTUAL PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF 
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE 
* POSSIBILITY OF SUCH DAMAGE. 
******************************************************************************/
#ifndef ADPD400x_REG_DEF_H
	#define ADPD400x_REG_DEF_H

#define ADPD400x_REG_INT_STATUS_FIFO 	0x0000
#define ADPD400x_REG_INT_STATUS_DATA 	0x0001
#define ADPD400x_REG_INT_STATUS_LEV0 	0x0002
#define ADPD400x_REG_INT_STATUS_LEV1 	0x0003
#define ADPD400x_REG_FIFO_CTL        	0x0006
#define ADPD400x_REG_INT_ACLEAR      	0x0007
#define ADPD400x_REG_CHIP_ID         	0x0008
#define ADPD400x_REG_OSC32M          	0x0009
#define ADPD400x_REG_OSC32M_CAL      	0x000a
#define ADPD400x_REG_OSC1M           	0x000b
#define ADPD400x_REG_OSC32K          	0x000c
#define ADPD400x_REG_TS_FREQ         	0x000d
#define ADPD400x_REG_TS_FREQH        	0x000e
#define ADPD400x_REG_SYS_CTL         	0x000F
#define ADPD400x_REG_OPMODE          	0x0010
#define ADPD400x_REG_STAMP_L         	0x0011
#define ADPD400x_REG_STAMP_H         	0x0012
#define ADPD400x_REG_STAMPDELTA      	0x0013
#define ADPD400x_REG_INT_ENABLE_XD   	0x0014
#define ADPD400x_REG_INT_ENABLE_YD   	0x0015
#define ADPD400x_REG_INT_ENABLE_XL0  	0x0016
#define ADPD400x_REG_INT_ENABLE_XL1  	0x0017
#define ADPD400x_REG_INT_ENABLE_YL0  	0x001a
#define ADPD400x_REG_INT_ENABLE_YL1  	0x001b
#define ADPD400x_REG_FIFO_STATUS_BYTES	0x001E
#define ADPD400x_REG_INPUT_SLEEP     	0x0020
#define ADPD400x_REG_INPUT_CFG       	0x0021
#define ADPD400x_REG_GPIO_CFG        	0x0022
#define ADPD400x_REG_GPIO01          	0x0023
#define ADPD400x_REG_GPIO23          	0x0024
#define ADPD400x_REG_GPIO_EXT           0x0026
#define ADPD400x_REG_GPIO_IN         	0x0025
#define ADPD400x_REG_DATA_HOLD_FLAG  	0x002E
#define ADPD400x_REG_FIFO_DATA       	0x002F
#define ADPD400x_REG_SIGNAL1_L_A     	0x0030
#define ADPD400x_REG_SIGNAL1_H_A     	0x0031
#define ADPD400x_REG_SIGNAL2_L_A     	0x0032
#define ADPD400x_REG_SIGNAL2_H_A     	0x0033
#define ADPD400x_REG_DARK1_L_A       	0x0034
#define ADPD400x_REG_DARK1_H_A       	0x0035
#define ADPD400x_REG_DARK2_L_A       	0x0036
#define ADPD400x_REG_DARK2_H_A       	0x0037
#define ADPD400x_REG_SIGNAL1_L_B     	0x0038
#define ADPD400x_REG_SIGNAL1_H_B     	0x0039
#define ADPD400x_REG_SIGNAL2_L_B     	0x003A
#define ADPD400x_REG_SIGNAL2_H_B     	0x003B
#define ADPD400x_REG_DARK1_L_B       	0x003C
#define ADPD400x_REG_DARK1_H_B       	0x003D
#define ADPD400x_REG_DARK2_L_B       	0x003E
#define ADPD400x_REG_DARK2_H_B       	0x003F
#define ADPD400x_REG_SIGNAL1_L_C     	0x0040
#define ADPD400x_REG_SIGNAL1_H_C     	0x0041
#define ADPD400x_REG_SIGNAL2_L_C     	0x0042
#define ADPD400x_REG_SIGNAL2_H_C     	0x0043
#define ADPD400x_REG_DARK1_L_C       	0x0044
#define ADPD400x_REG_DARK1_H_C       	0x0045
#define ADPD400x_REG_DARK2_L_C       	0x0046
#define ADPD400x_REG_DARK2_H_C       	0x0047
#define ADPD400x_REG_SIGNAL1_L_D     	0x0048
#define ADPD400x_REG_SIGNAL1_H_D     	0x0049
#define ADPD400x_REG_SIGNAL2_L_D     	0x004A
#define ADPD400x_REG_SIGNAL2_H_D     	0x004B
#define ADPD400x_REG_DARK1_L_D       	0x004C
#define ADPD400x_REG_DARK1_H_D       	0x004D
#define ADPD400x_REG_DARK2_L_D       	0x004E
#define ADPD400x_REG_DARK2_H_D       	0x004F
#define ADPD400x_REG_SIGNAL1_L_E     	0x0050
#define ADPD400x_REG_SIGNAL1_H_E     	0x0051
#define ADPD400x_REG_SIGNAL2_L_E     	0x0052
#define ADPD400x_REG_SIGNAL2_H_E     	0x0053
#define ADPD400x_REG_DARK1_L_E       	0x0054
#define ADPD400x_REG_DARK1_H_E       	0x0055
#define ADPD400x_REG_DARK2_L_E       	0x0056
#define ADPD400x_REG_DARK2_H_E       	0x0057
#define ADPD400x_REG_SIGNAL1_L_F     	0x0058
#define ADPD400x_REG_SIGNAL1_H_F     	0x0059
#define ADPD400x_REG_SIGNAL2_L_F     	0x005A
#define ADPD400x_REG_SIGNAL2_H_F     	0x005B
#define ADPD400x_REG_DARK1_L_F       	0x005C
#define ADPD400x_REG_DARK1_H_F       	0x005D
#define ADPD400x_REG_DARK2_L_F       	0x005E
#define ADPD400x_REG_DARK2_H_F       	0x005F
#define ADPD400x_REG_SIGNAL1_L_G     	0x0060
#define ADPD400x_REG_SIGNAL1_H_G     	0x0061
#define ADPD400x_REG_SIGNAL2_L_G     	0x0062
#define ADPD400x_REG_SIGNAL2_H_G     	0x0063
#define ADPD400x_REG_DARK1_L_G       	0x0064
#define ADPD400x_REG_DARK1_H_G       	0x0065
#define ADPD400x_REG_DARK2_L_G       	0x0066
#define ADPD400x_REG_DARK2_H_G       	0x0067
#define ADPD400x_REG_SIGNAL1_L_H     	0x0068
#define ADPD400x_REG_SIGNAL1_H_H     	0x0069
#define ADPD400x_REG_SIGNAL2_L_H     	0x006A
#define ADPD400x_REG_SIGNAL2_H_H     	0x006B
#define ADPD400x_REG_DARK1_L_H       	0x006C
#define ADPD400x_REG_DARK1_H_H       	0x006D
#define ADPD400x_REG_DARK2_L_H       	0x006E
#define ADPD400x_REG_DARK2_H_H       	0x006F
#define ADPD400x_REG_SIGNAL1_L_I     	0x0070
#define ADPD400x_REG_SIGNAL1_H_I     	0x0071
#define ADPD400x_REG_SIGNAL2_L_I     	0x0072
#define ADPD400x_REG_SIGNAL2_H_I     	0x0073
#define ADPD400x_REG_DARK1_L_I       	0x0074
#define ADPD400x_REG_DARK1_H_I       	0x0075
#define ADPD400x_REG_DARK2_L_I       	0x0076
#define ADPD400x_REG_DARK2_H_I       	0x0077
#define ADPD400x_REG_SIGNAL1_L_J     	0x0078
#define ADPD400x_REG_SIGNAL1_H_J     	0x0079
#define ADPD400x_REG_SIGNAL2_L_J     	0x007A
#define ADPD400x_REG_SIGNAL2_H_J     	0x007B
#define ADPD400x_REG_DARK1_L_J       	0x007C
#define ADPD400x_REG_DARK1_H_J       	0x007D
#define ADPD400x_REG_DARK2_L_J       	0x007E
#define ADPD400x_REG_DARK2_H_J       	0x007F
#define ADPD400x_REG_SIGNAL1_L_K     	0x0080
#define ADPD400x_REG_SIGNAL1_H_K     	0x0081
#define ADPD400x_REG_SIGNAL2_L_K     	0x0082
#define ADPD400x_REG_SIGNAL2_H_K     	0x0083
#define ADPD400x_REG_DARK1_L_K       	0x0084
#define ADPD400x_REG_DARK1_H_K       	0x0085
#define ADPD400x_REG_DARK2_L_K       	0x0086
#define ADPD400x_REG_DARK2_H_K       	0x0087
#define ADPD400x_REG_SIGNAL1_L_L     	0x0088
#define ADPD400x_REG_SIGNAL1_H_L     	0x0089
#define ADPD400x_REG_SIGNAL2_L_L     	0x008A
#define ADPD400x_REG_SIGNAL2_H_L     	0x008B
#define ADPD400x_REG_DARK1_L_L       	0x008C
#define ADPD400x_REG_DARK1_H_L       	0x008D
#define ADPD400x_REG_DARK2_L_L       	0x008E
#define ADPD400x_REG_DARK2_H_L       	0x008F
#define ADPD400x_REG_OSC_TRIM        	0x00A0
#define ADPD400x_REG_OSC32K_TRIM     	0x00A1
#define ADPD400x_REG_LED_TRIM        	0x00B1
#define ADPD400x_REG_I2C_KEY         	0x00B6
#define ADPD400x_REG_I2C_ADDR        	0x00B7
#define ADPD400x_REG_TS_CTRL_A       	0x0100
#define ADPD400x_REG_TS_PATH_A       	0x0101
#define ADPD400x_REG_INPUTS_A        	0x0102
#define ADPD400x_REG_CATHODE_A       	0x0103
#define ADPD400x_REG_AFE_TRIM_A      	0x0104
#define ADPD400x_REG_LED_POW12_A     	0x0105
#define ADPD400x_REG_LED_POW34_A     	0x0106
#define ADPD400x_REG_COUNTS_A        	0x0107
#define ADPD400x_REG_PERIOD_A        	0x0108
#define ADPD400x_REG_LED_PULSE_A     	0x0109
#define ADPD400x_REG_INTEG_WIDTH_A   	0x010A
#define ADPD400x_REG_INTEG_OFFSET_A  	0x010B
#define ADPD400x_REG_MOD_PULSE_A     	0x010C
#define ADPD400x_REG_PATTERN_A       	0x010D
#define ADPD400x_REG_ADC_OFF1_A      	0x010E
#define ADPD400x_REG_ADC_OFF2_A      	0x010F
#define ADPD400x_REG_DATA1_A         	0x0110
#define ADPD400x_REG_DATA2_A         	0x0111
#define ADPD400x_REG_DECIMATE_A      	0x0112
#define ADPD400x_REG_DIGINT_LIT_A    	0x0113
#define ADPD400x_REG_DIGINT_DARK_A   	0x0114
#define ADPD400x_REG_THRESH_CFG_A    	0x0115
#define ADPD400x_REG_THRESH0_A       	0x0116
#define ADPD400x_REG_THRESH1_A       	0x0117
#define ADPD400x_REG_TS_CTRL_B       	0x0120
#define ADPD400x_REG_TS_PATH_B       	0x0121
#define ADPD400x_REG_INPUTS_B        	0x0122
#define ADPD400x_REG_CATHODE_B       	0x0123
#define ADPD400x_REG_AFE_TRIM_B      	0x0124
#define ADPD400x_REG_LED_POW12_B     	0x0125
#define ADPD400x_REG_LED_POW34_B     	0x0126
#define ADPD400x_REG_COUNTS_B        	0x0127
#define ADPD400x_REG_PERIOD_B        	0x0128
#define ADPD400x_REG_LED_PULSE_B     	0x0129
#define ADPD400x_REG_INTEG_WIDTH_B   	0x012A
#define ADPD400x_REG_INTEG_OFFSET_B  	0x012B
#define ADPD400x_REG_MOD_PULSE_B     	0x012C
#define ADPD400x_REG_PATTERN_B       	0x012D
#define ADPD400x_REG_ADC_OFF1_B      	0x012E
#define ADPD400x_REG_ADC_OFF2_B      	0x012F
#define ADPD400x_REG_DATA1_B         	0x0130
#define ADPD400x_REG_DATA2_B         	0x0131
#define ADPD400x_REG_DECIMATE_B      	0x0132
#define ADPD400x_REG_DIGINT_LIT_B    	0x0133
#define ADPD400x_REG_DIGINT_DARK_B   	0x0134
#define ADPD400x_REG_THRESH_CFG_B    	0x0135
#define ADPD400x_REG_THRESH0_B       	0x0136
#define ADPD400x_REG_THRESH1_B       	0x0137
#define ADPD400x_REG_TS_CTRL_C       	0x0140
#define ADPD400x_REG_TS_PATH_C       	0x0141
#define ADPD400x_REG_INPUTS_C        	0x0142
#define ADPD400x_REG_CATHODE_C       	0x0143
#define ADPD400x_REG_AFE_TRIM_C      	0x0144
#define ADPD400x_REG_LED_POW12_C     	0x0145
#define ADPD400x_REG_LED_POW34_C     	0x0146
#define ADPD400x_REG_COUNTS_C        	0x0147
#define ADPD400x_REG_PERIOD_C        	0x0148
#define ADPD400x_REG_LED_PULSE_C     	0x0149
#define ADPD400x_REG_INTEG_WIDTH_C   	0x014A
#define ADPD400x_REG_INTEG_OFFSET_C  	0x014B
#define ADPD400x_REG_MOD_PULSE_C     	0x014C
#define ADPD400x_REG_PATTERN_C       	0x014D
#define ADPD400x_REG_ADC_OFF1_C      	0x014E
#define ADPD400x_REG_ADC_OFF2_C      	0x014F
#define ADPD400x_REG_DATA1_C         	0x0150
#define ADPD400x_REG_DATA2_C         	0x0151
#define ADPD400x_REG_DECIMATE_C      	0x0152
#define ADPD400x_REG_DIGINT_LIT_C    	0x0153
#define ADPD400x_REG_DIGINT_DARK_C   	0x0154
#define ADPD400x_REG_THRESH_CFG_C    	0x0155
#define ADPD400x_REG_THRESH0_C       	0x0156
#define ADPD400x_REG_THRESH1_C       	0x0157
#define ADPD400x_REG_TS_CTRL_D       	0x0160
#define ADPD400x_REG_TS_PATH_D       	0x0161
#define ADPD400x_REG_INPUTS_D        	0x0162
#define ADPD400x_REG_CATHODE_D       	0x0163
#define ADPD400x_REG_AFE_TRIM_D      	0x0164
#define ADPD400x_REG_LED_POW12_D     	0x0165
#define ADPD400x_REG_LED_POW34_D     	0x0166
#define ADPD400x_REG_COUNTS_D        	0x0167
#define ADPD400x_REG_PERIOD_D        	0x0168
#define ADPD400x_REG_LED_PULSE_D     	0x0169
#define ADPD400x_REG_INTEG_WIDTH_D   	0x016A
#define ADPD400x_REG_INTEG_OFFSET_D  	0x016B
#define ADPD400x_REG_MOD_PULSE_D     	0x016C
#define ADPD400x_REG_PATTERN_D       	0x016D
#define ADPD400x_REG_ADC_OFF1_D      	0x016E
#define ADPD400x_REG_ADC_OFF2_D      	0x016F
#define ADPD400x_REG_DATA1_D         	0x0170
#define ADPD400x_REG_DATA2_D         	0x0171
#define ADPD400x_REG_DECIMATE_D      	0x0172
#define ADPD400x_REG_DIGINT_LIT_D    	0x0173
#define ADPD400x_REG_DIGINT_DARK_D   	0x0174
#define ADPD400x_REG_THRESH_CFG_D    	0x0175
#define ADPD400x_REG_THRESH0_D       	0x0176
#define ADPD400x_REG_THRESH1_D       	0x0177
#define ADPD400x_REG_TS_CTRL_E       	0x0180
#define ADPD400x_REG_TS_PATH_E       	0x0181
#define ADPD400x_REG_INPUTS_E        	0x0182
#define ADPD400x_REG_CATHODE_E       	0x0183
#define ADPD400x_REG_AFE_TRIM_E      	0x0184
#define ADPD400x_REG_LED_POW12_E     	0x0185
#define ADPD400x_REG_LED_POW34_E     	0x0186
#define ADPD400x_REG_COUNTS_E        	0x0187
#define ADPD400x_REG_PERIOD_E        	0x0188
#define ADPD400x_REG_LED_PULSE_E     	0x0189
#define ADPD400x_REG_INTEG_WIDTH_E   	0x018A
#define ADPD400x_REG_INTEG_OFFSET_E  	0x018B
#define ADPD400x_REG_MOD_PULSE_E     	0x018C
#define ADPD400x_REG_PATTERN_E       	0x018D
#define ADPD400x_REG_ADC_OFF1_E      	0x018E
#define ADPD400x_REG_ADC_OFF2_E      	0x018F
#define ADPD400x_REG_DATA1_E         	0x0190
#define ADPD400x_REG_DATA2_E         	0x0191
#define ADPD400x_REG_DECIMATE_E      	0x0192
#define ADPD400x_REG_DIGINT_LIT_E    	0x0193
#define ADPD400x_REG_DIGINT_DARK_E   	0x0194
#define ADPD400x_REG_THRESH_CFG_E    	0x0195
#define ADPD400x_REG_THRESH0_E       	0x0196
#define ADPD400x_REG_THRESH1_E       	0x0197
#define ADPD400x_REG_TS_CTRL_F       	0x01A0
#define ADPD400x_REG_TS_PATH_F       	0x01A1
#define ADPD400x_REG_INPUTS_F        	0x01A2
#define ADPD400x_REG_CATHODE_F       	0x01A3
#define ADPD400x_REG_AFE_TRIM_F      	0x01A4
#define ADPD400x_REG_LED_POW12_F     	0x01A5
#define ADPD400x_REG_LED_POW34_F     	0x01A6
#define ADPD400x_REG_COUNTS_F        	0x01A7
#define ADPD400x_REG_PERIOD_F        	0x01A8
#define ADPD400x_REG_LED_PULSE_F     	0x01A9
#define ADPD400x_REG_INTEG_WIDTH_F   	0x01AA
#define ADPD400x_REG_INTEG_OFFSET_F  	0x01AB
#define ADPD400x_REG_MOD_PULSE_F     	0x01AC
#define ADPD400x_REG_PATTERN_F       	0x01AD
#define ADPD400x_REG_ADC_OFF1_F      	0x01AE
#define ADPD400x_REG_ADC_OFF2_F      	0x01AF
#define ADPD400x_REG_DATA1_F         	0x01B0
#define ADPD400x_REG_DATA2_F         	0x01B1
#define ADPD400x_REG_DECIMATE_F      	0x01B2
#define ADPD400x_REG_DIGINT_LIT_F    	0x01B3
#define ADPD400x_REG_DIGINT_DARK_F   	0x01B4
#define ADPD400x_REG_THRESH_CFG_F    	0x01B5
#define ADPD400x_REG_THRESH0_F       	0x01B6
#define ADPD400x_REG_THRESH1_F       	0x01B7
#define ADPD400x_REG_TS_CTRL_G       	0x01C0
#define ADPD400x_REG_TS_PATH_G       	0x01C1
#define ADPD400x_REG_INPUTS_G        	0x01C2
#define ADPD400x_REG_CATHODE_G       	0x01C3
#define ADPD400x_REG_AFE_TRIM_G      	0x01C4
#define ADPD400x_REG_LED_POW12_G     	0x01C5
#define ADPD400x_REG_LED_POW34_G     	0x01C6
#define ADPD400x_REG_COUNTS_G        	0x01C7
#define ADPD400x_REG_PERIOD_G        	0x01C8
#define ADPD400x_REG_LED_PULSE_G     	0x01C9
#define ADPD400x_REG_INTEG_WIDTH_G   	0x01CA
#define ADPD400x_REG_INTEG_OFFSET_G  	0x01CB
#define ADPD400x_REG_MOD_PULSE_G     	0x01CC
#define ADPD400x_REG_PATTERN_G       	0x01CD
#define ADPD400x_REG_ADC_OFF1_G      	0x01CE
#define ADPD400x_REG_ADC_OFF2_G      	0x01CF
#define ADPD400x_REG_DATA1_G         	0x01D0
#define ADPD400x_REG_DATA2_G         	0x01D1
#define ADPD400x_REG_DECIMATE_G      	0x01D2
#define ADPD400x_REG_DIGINT_LIT_G    	0x01D3
#define ADPD400x_REG_DIGINT_DARK_G   	0x01D4
#define ADPD400x_REG_THRESH_CFG_G    	0x01D5
#define ADPD400x_REG_THRESH0_G       	0x01D6
#define ADPD400x_REG_THRESH1_G       	0x01D7
#define ADPD400x_REG_TS_CTRL_H       	0x01E0
#define ADPD400x_REG_TS_PATH_H       	0x01E1
#define ADPD400x_REG_INPUTS_H        	0x01E2
#define ADPD400x_REG_CATHODE_H       	0x01E3
#define ADPD400x_REG_AFE_TRIM_H      	0x01E4
#define ADPD400x_REG_LED_POW12_H     	0x01E5
#define ADPD400x_REG_LED_POW34_H     	0x01E6
#define ADPD400x_REG_COUNTS_H        	0x01E7
#define ADPD400x_REG_PERIOD_H        	0x01E8
#define ADPD400x_REG_LED_PULSE_H     	0x01E9
#define ADPD400x_REG_INTEG_WIDTH_H   	0x01EA
#define ADPD400x_REG_INTEG_OFFSET_H  	0x01EB
#define ADPD400x_REG_MOD_PULSE_H     	0x01EC
#define ADPD400x_REG_PATTERN_H       	0x01ED
#define ADPD400x_REG_ADC_OFF1_H      	0x01EE
#define ADPD400x_REG_ADC_OFF2_H      	0x01EF
#define ADPD400x_REG_DATA1_H         	0x01F0
#define ADPD400x_REG_DATA2_H         	0x01F1
#define ADPD400x_REG_DECIMATE_H      	0x01F2
#define ADPD400x_REG_DIGINT_LIT_H    	0x01F3
#define ADPD400x_REG_DIGINT_DARK_H   	0x01F4
#define ADPD400x_REG_THRESH_CFG_H    	0x01F5
#define ADPD400x_REG_THRESH0_H       	0x01F6
#define ADPD400x_REG_THRESH1_H       	0x01F7
#define ADPD400x_REG_TS_CTRL_I       	0x0200
#define ADPD400x_REG_TS_PATH_I       	0x0201
#define ADPD400x_REG_INPUTS_I        	0x0202
#define ADPD400x_REG_CATHODE_I       	0x0203
#define ADPD400x_REG_AFE_TRIM_I      	0x0204
#define ADPD400x_REG_LED_POW12_I     	0x0205
#define ADPD400x_REG_LED_POW34_I     	0x0206
#define ADPD400x_REG_COUNTS_I        	0x0207
#define ADPD400x_REG_PERIOD_I        	0x0208
#define ADPD400x_REG_LED_PULSE_I     	0x0209
#define ADPD400x_REG_INTEG_WIDTH_I   	0x020A
#define ADPD400x_REG_INTEG_OFFSET_I  	0x020B
#define ADPD400x_REG_MOD_PULSE_I     	0x020C
#define ADPD400x_REG_PATTERN_I       	0x020D
#define ADPD400x_REG_ADC_OFF1_I      	0x020E
#define ADPD400x_REG_ADC_OFF2_I      	0x020F
#define ADPD400x_REG_DATA1_I         	0x0210
#define ADPD400x_REG_DATA2_I         	0x0211
#define ADPD400x_REG_DECIMATE_I      	0x0212
#define ADPD400x_REG_DIGINT_LIT_I    	0x0213
#define ADPD400x_REG_DIGINT_DARK_I   	0x0214
#define ADPD400x_REG_THRESH_CFG_I    	0x0215
#define ADPD400x_REG_THRESH0_I       	0x0216
#define ADPD400x_REG_THRESH1_I       	0x0217
#define ADPD400x_REG_TS_CTRL_J       	0x0220
#define ADPD400x_REG_TS_PATH_J       	0x0221
#define ADPD400x_REG_INPUTS_J        	0x0222
#define ADPD400x_REG_CATHODE_J       	0x0223
#define ADPD400x_REG_AFE_TRIM_J      	0x0224
#define ADPD400x_REG_LED_POW12_J     	0x0225
#define ADPD400x_REG_LED_POW34_J     	0x0226
#define ADPD400x_REG_COUNTS_J        	0x0227
#define ADPD400x_REG_PERIOD_J        	0x0228
#define ADPD400x_REG_LED_PULSE_J     	0x0229
#define ADPD400x_REG_INTEG_WIDTH_J   	0x022A
#define ADPD400x_REG_INTEG_OFFSET_J  	0x022B
#define ADPD400x_REG_MOD_PULSE_J     	0x022C
#define ADPD400x_REG_PATTERN_J       	0x022D
#define ADPD400x_REG_ADC_OFF1_J      	0x022E
#define ADPD400x_REG_ADC_OFF2_J      	0x022F
#define ADPD400x_REG_DATA1_J         	0x0230
#define ADPD400x_REG_DATA2_J         	0x0231
#define ADPD400x_REG_DECIMATE_J      	0x0232
#define ADPD400x_REG_DIGINT_LIT_J    	0x0233
#define ADPD400x_REG_DIGINT_DARK_J   	0x0234
#define ADPD400x_REG_THRESH_CFG_J    	0x0235
#define ADPD400x_REG_THRESH0_J       	0x0236
#define ADPD400x_REG_THRESH1_J       	0x0237
#define ADPD400x_REG_TS_CTRL_K       	0x0240
#define ADPD400x_REG_TS_PATH_K       	0x0241
#define ADPD400x_REG_INPUTS_K        	0x0242
#define ADPD400x_REG_CATHODE_K       	0x0243
#define ADPD400x_REG_AFE_TRIM_K      	0x0244
#define ADPD400x_REG_LED_POW12_K     	0x0245
#define ADPD400x_REG_LED_POW34_K     	0x0246
#define ADPD400x_REG_COUNTS_K        	0x0247
#define ADPD400x_REG_PERIOD_K        	0x0248
#define ADPD400x_REG_LED_PULSE_K     	0x0249
#define ADPD400x_REG_INTEG_WIDTH_K   	0x024A
#define ADPD400x_REG_INTEG_OFFSET_K  	0x024B
#define ADPD400x_REG_MOD_PULSE_K     	0x024C
#define ADPD400x_REG_PATTERN_K       	0x024D
#define ADPD400x_REG_ADC_OFF1_K      	0x024E
#define ADPD400x_REG_ADC_OFF2_K      	0x024F
#define ADPD400x_REG_DATA1_K         	0x0250
#define ADPD400x_REG_DATA2_K         	0x0251
#define ADPD400x_REG_DECIMATE_K      	0x0252
#define ADPD400x_REG_DIGINT_LIT_K    	0x0253
#define ADPD400x_REG_DIGINT_DARK_K   	0x0254
#define ADPD400x_REG_THRESH_CFG_K    	0x0255
#define ADPD400x_REG_THRESH0_K       	0x0256
#define ADPD400x_REG_THRESH1_K       	0x0257
#define ADPD400x_REG_TS_CTRL_L       	0x0260
#define ADPD400x_REG_TS_PATH_L       	0x0261
#define ADPD400x_REG_INPUTS_L        	0x0262
#define ADPD400x_REG_CATHODE_L       	0x0263
#define ADPD400x_REG_AFE_TRIM_L      	0x0264
#define ADPD400x_REG_LED_POW12_L     	0x0265
#define ADPD400x_REG_LED_POW34_L     	0x0266
#define ADPD400x_REG_COUNTS_L        	0x0267
#define ADPD400x_REG_PERIOD_L        	0x0268
#define ADPD400x_REG_LED_PULSE_L     	0x0269
#define ADPD400x_REG_INTEG_WIDTH_L   	0x026A
#define ADPD400x_REG_INTEG_OFFSET_L  	0x026B
#define ADPD400x_REG_MOD_PULSE_L     	0x026C
#define ADPD400x_REG_PATTERN_L       	0x026D
#define ADPD400x_REG_ADC_OFF1_L      	0x026E
#define ADPD400x_REG_ADC_OFF2_L      	0x026F
#define ADPD400x_REG_DATA1_L         	0x0270
#define ADPD400x_REG_DATA2_L         	0x0271
#define ADPD400x_REG_DECIMATE_L      	0x0272
#define ADPD400x_REG_DIGINT_LIT_L    	0x0273
#define ADPD400x_REG_DIGINT_DARK_L   	0x0274
#define ADPD400x_REG_THRESH_CFG_L    	0x0275
#define ADPD400x_REG_THRESH0_L       	0x0276
#define ADPD400x_REG_THRESH1_L       	0x0277


/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_STATUS_FIFO						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_STATUS_FIFO_FIFO_BYTE_COUNT    	0			/*Number of bytes in fifo*/
#define BITP_INT_STATUS_FIFO_INT_FIFO_OFLOW     	13			/*Fifo overflow error.*/
#define BITP_INT_STATUS_FIFO_INT_FIFO_UFLOW     	14			/*Timeslot A data register interrupt status*/
#define BITP_INT_STATUS_FIFO_CLEAR_FIFO         	15			/*Clear FIFO*/
#define BITM_INT_STATUS_FIFO_FIFO_BYTE_COUNT    	0x07ff		/*Number of bytes in fifo*/
#define BITM_INT_STATUS_FIFO_INT_FIFO_OFLOW     	0x2000		/*Fifo overflow error.*/
#define BITM_INT_STATUS_FIFO_INT_FIFO_UFLOW     	0x4000		/*Timeslot A data register interrupt status*/
#define BITM_INT_STATUS_FIFO_CLEAR_FIFO         	0x8000		/*Clear FIFO*/

