ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_STATUS_DATA						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_STATUS_DATA_INT_DATA_A         	0			/*Timeslot A data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_B         	1			/*Timeslot B data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_C         	2			/*Timeslot C data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_D         	3			/*Timeslot D data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_E         	4			/*Timeslot E data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_F         	5			/*Timeslot F data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_G         	6			/*Timeslot G data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_H         	7			/*Timeslot H data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_I         	8			/*Timeslot I data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_J         	9			/*Timeslot J data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_K         	10			/*Timeslot K data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_DATA_L         	11			/*Timeslot L data register interrupt status*/
#define BITP_INT_STATUS_DATA_INT_FIFO_TH        	15			/*Fifo_th interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_A         	0x0001		/*Timeslot A data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_B         	0x0002		/*Timeslot B data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_C         	0x0004		/*Timeslot C data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_D         	0x0008		/*Timeslot D data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_E         	0x0010		/*Timeslot E data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_F         	0x0020		/*Timeslot F data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_G         	0x0040		/*Timeslot G data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_H         	0x0080		/*Timeslot H data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_I         	0x0100		/*Timeslot I data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_J         	0x0200		/*Timeslot J data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_K         	0x0400		/*Timeslot K data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_DATA_L         	0x0800		/*Timeslot L data register interrupt status*/
#define BITM_INT_STATUS_DATA_INT_FIFO_TH        	0x8000		/*Fifo_th interrupt status*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_STATUS_LEV0						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_STATUS_LEV0_INT_LEV0_A         	0			/*Timeslot A level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_B         	1			/*Timeslot B level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_C         	2			/*Timeslot C level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_D         	3			/*Timeslot D level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_E         	4			/*Timeslot E level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_F         	5			/*Timeslot F level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_G         	6			/*Timeslot G level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_H         	7			/*Timeslot H level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_I         	8			/*Timeslot I level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_J         	9			/*Timeslot J level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_K         	10			/*Timeslot K level 0 interrupt status*/
#define BITP_INT_STATUS_LEV0_INT_LEV0_L         	11			/*Timeslot L level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_A         	0x0001		/*Timeslot A level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_B         	0x0002		/*Timeslot B level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_C         	0x0004		/*Timeslot C level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_D         	0x0008		/*Timeslot D level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_E         	0x0010		/*Timeslot E level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_F         	0x0020		/*Timeslot F level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_G         	0x0040		/*Timeslot G level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_H         	0x0080		/*Timeslot H level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_I         	0x0100		/*Timeslot I level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_J         	0x0200		/*Timeslot J level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_K         	0x0400		/*Timeslot K level 0 interrupt status*/
#define BITM_INT_STATUS_LEV0_INT_LEV0_L         	0x0800		/*Timeslot L level 0 interrupt status*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_STATUS_LEV1						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_STATUS_LEV1_INT_LEV1_A         	0			/*Timeslot A level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_B         	1			/*Timeslot B level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_C         	2			/*Timeslot C level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_D         	3			/*Timeslot D level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_E         	4			/*Timeslot E level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_F         	5			/*Timeslot F level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_G         	6			/*Timeslot G level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_H         	7			/*Timeslot H level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_I         	8			/*Timeslot I level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_J         	9			/*Timeslot J level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_K         	10			/*Timeslot K level 1 interrupt status*/
#define BITP_INT_STATUS_LEV1_INT_LEV1_L         	11			/*Timeslot L level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_A         	0x0001		/*Timeslot A level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_B         	0x0002		/*Timeslot B level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_C         	0x0004		/*Timeslot C level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_D         	0x0008		/*Timeslot D level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_E         	0x0010		/*Timeslot E level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_F         	0x0020		/*Timeslot F level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_G         	0x0040		/*Timeslot G level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_H         	0x0080		/*Timeslot H level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_I         	0x0100		/*Timeslot I level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_J         	0x0200		/*Timeslot J level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_K         	0x0400		/*Timeslot K level 1 interrupt status*/
#define BITM_INT_STATUS_LEV1_INT_LEV1_L         	0x0800		/*Timeslot L level 1 interrupt status*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_FIFO_CTL						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_FIFO_CTL_FIFO_TH                   	0			/*Fifo Interrupt Generation Threshold.*/
#define BITM_FIFO_CTL_FIFO_TH                   	0x03ff		/*Fifo Interrupt Generation Threshold.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ACLEAR						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_A       	0			/*Timeslot A Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_B       	1			/*Timeslot B Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_C       	2			/*Timeslot C Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_D       	3			/*Timeslot D Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_E       	4			/*Timeslot E Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_F       	5			/*Timeslot F Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_G       	6			/*Timeslot G Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_H       	7			/*Timeslot H Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_I       	8			/*Timeslot I Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_J       	9			/*Timeslot J Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_K       	10			/*Timeslot K Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_DATA_L       	11			/*Timeslot L Interrupt auto clear enable*/
#define BITP_INT_ACLEAR_INT_ACLEAR_FIFO         	15			/*FIFO Threshold Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_A       	0x0001		/*Timeslot A Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_B       	0x0002		/*Timeslot B Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_C       	0x0004		/*Timeslot C Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_D       	0x0008		/*Timeslot D Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_E       	0x0010		/*Timeslot E Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_F       	0x0020		/*Timeslot F Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_G       	0x0040		/*Timeslot G Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_H       	0x0080		/*Timeslot H Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_I       	0x0100		/*Timeslot I Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_J       	0x0200		/*Timeslot J Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_K       	0x0400		/*Timeslot K Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_DATA_L       	0x0800		/*Timeslot L Interrupt auto clear enable*/
#define BITM_INT_ACLEAR_INT_ACLEAR_FIFO         	0x8000		/*FIFO Threshold Interrupt auto clear enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CHIP_ID						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CHIP_ID_CHIP_ID                    	0			/*Chip ID*/
#define BITP_CHIP_ID_VERSION                    	8			/*Mask Version*/
#define BITM_CHIP_ID_CHIP_ID                    	0x00ff		/*Chip ID*/
#define BITM_CHIP_ID_VERSION                    	0xff00		/*Mask Version*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_OSC32M						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_OSC32M_OSC_32M_FREQ_ADJ            	0			/*High Freq Oscillator Frequency Control*/
#define BITM_OSC32M_OSC_32M_FREQ_ADJ            	0x00ff		/*High Freq Oscillator Frequency Control*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_OSC32M_CAL						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_OSC32M_CAL_OSC_32M_CAL_COUNT       	0			/*High Freq Oscillator Calibration Count*/
#define BITP_OSC32M_CAL_OSC_32M_CAL_START       	15			/*Start High Freq Oscillator Calibration cycle*/
#define BITM_OSC32M_CAL_OSC_32M_CAL_COUNT       	0x7fff		/*High Freq Oscillator Calibration Count*/
#define BITM_OSC32M_CAL_OSC_32M_CAL_START       	0x8000		/*Start High Freq Oscillator Calibration cycle*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_OSC1M						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_OSC1M_OSC_1M_FREQ_ADJ              	0			/*Low Freq Oscillator Frequency Control*/
#define BITP_OSC1M_OSC_CAL_DISABLE              	(10U)			/*Disable clock calibration clocking*/
#define BITM_OSC1M_OSC_1M_FREQ_ADJ              	0x03ff		/*Low Freq Oscillator Frequency Control*/
#define BITM_OSC1M_OSC_CAL_DISABLE              	(0x0400U)		/*Disable clock calibration clocking*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_OSC32K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_OSC32K_OSC_32K_ADJUST              	0			/*32KHz oscillator trim*/
#define BITP_OSC32K_CAPTURE_TIMESTAMP           	15			/*Enable Timestamp capture*/
#define BITM_OSC32K_OSC_32K_ADJUST              	0x003f		/*32KHz oscillator trim*/
#define BITM_OSC32K_CAPTURE_TIMESTAMP           	0x8000		/*Enable Timestamp capture*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_FREQ						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_FREQ_TIMESLOT_PERIOD_L          	0			/*Lower 16 bits of timeslot period in lfosc cycles.*/
#define BITM_TS_FREQ_TIMESLOT_PERIOD_L          	0xffff		/*Lower 16 bits of timeslot period in lfosc cycles.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_FREQH						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_FREQH_TIMESLOT_PERIOD_H         	0			/*Upper 7 bits of timeslot period in lfosc cycles.*/
#define BITM_TS_FREQH_TIMESLOT_PERIOD_H         	0x007f		/*Upper 7 bits of timeslot period in lfosc cycles.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SYS_CTL						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_CTL_OSC_32K_EN                 	0			/*Enable Low Frequency Oscillator*/
#define BITP_SYS_CTL_OSC_1M_EN                  	1			/*Enable Low Frequency Oscillator*/
#define BITP_SYS_CTL_LFOSC_SEL                  	2			/*Select Low Frequency Oscillator*/
#define BITP_SYS_CTL_RANDOM_SLEEP               	3			/*Enable Random Sleep LSFR*/
#define BITP_SYS_CTL_GO_SLEEP                   	4			/*Sleep before first timeslot group on GO*/
#define BITP_SYS_CTL_ALT_CLK_GPIO               	6			/*Alternate Clock GPIO Select*/
#define BITP_SYS_CTL_ALT_CLOCKS                 	8			/*External clock select*/
#define BITP_SYS_CTL_SW_RESET                   	15			/*Software Reset*/
#define BITM_SYS_CTL_OSC_32K_EN                 	0x0001		/*Enable Low Frequency Oscillator*/
#define BITM_SYS_CTL_OSC_1M_EN                  	0x0002		/*Enable Low Frequency Oscillator*/
#define BITM_SYS_CTL_LFOSC_SEL                  	0x0004		/*Select Low Frequency Oscillator*/
#define BITM_SYS_CTL_RANDOM_SLEEP               	0x0008		/*Enable Random Sleep LSFR*/
#define BITM_SYS_CTL_GO_SLEEP                   	0x0010		/*Sleep before first timeslot group on GO*/
#define BITM_SYS_CTL_ALT_CLK_GPIO               	0x00c0		/*Alternate Clock GPIO Select*/
#define BITM_SYS_CTL_ALT_CLOCKS                 	0x0300		/*External clock select*/
#define BITM_SYS_CTL_SW_RESET                   	0x8000		/*Software Reset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_OPMODE						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_OPMODE_OP_MODE                     	0			/*Operating Mode*/
#define BITP_OPMODE_TIMESLOT_EN                 	8			/*Timeslot enable control*/
#define BITM_OPMODE_OP_MODE                     	0x0007		/*Operating Mode*/
#define BITM_OPMODE_TIMESLOT_EN                 	0x0f00		/*Timeslot enable control*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_STAMP_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_STAMP_L_TIMESTAMP_COUNT_L          	0			/*Count at last timestamp*/
#define BITM_STAMP_L_TIMESTAMP_COUNT_L          	0xffff		/*Count at last timestamp*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_STAMP_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_STAMP_H_TIMESTAMP_COUNT_H          	0			/*Count at last timestamp*/
#define BITM_STAMP_H_TIMESTAMP_COUNT_H          	0xffff		/*Count at last timestamp*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_STAMPDELTA						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_STAMPDELTA_TIMESTAMP_SLOT_DELTA    	0			/*Count remaining until next wakeup start*/
#define BITM_STAMPDELTA_TIMESTAMP_SLOT_DELTA    	0xffff		/*Count remaining until next wakeup start*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ENABLE_XD						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_A       	0			/*Interrupt channel X Timeslot A data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_B       	1			/*Interrupt channel X Timeslot B data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_C       	2			/*Interrupt channel X Timeslot C data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_D       	3			/*Interrupt channel X Timeslot D data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_E       	4			/*Interrupt channel X Timeslot E data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_F       	5			/*Interrupt channel X Timeslot F data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_G       	6			/*Interrupt channel X Timeslot G data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_H       	7			/*Interrupt channel X Timeslot H data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_I       	8			/*Interrupt channel X Timeslot I data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_J       	9			/*Interrupt channel X Timeslot J data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_K       	10			/*Interrupt channel X Timeslot K data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_DATA_L       	11			/*Interrupt channel X Timeslot L data interrupt enable*/
#define BITP_INT_ENABLE_XD_INTX_EN_FIFO_OFLOW   	13			/*FIFO overflow Interrupt enable for interrupt channel X*/
#define BITP_INT_ENABLE_XD_INTX_EN_FIFO_UFLOW   	14			/*FIFO underflow Interrupt enable for interrupt channel X*/
#define BITP_INT_ENABLE_XD_INTX_EN_FIFO_TH      	15			/*FIFO Threshold Interrupt Enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_A       	0x0001		/*Interrupt channel X Timeslot A data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_B       	0x0002		/*Interrupt channel X Timeslot B data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_C       	0x0004		/*Interrupt channel X Timeslot C data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_D       	0x0008		/*Interrupt channel X Timeslot D data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_E       	0x0010		/*Interrupt channel X Timeslot E data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_F       	0x0020		/*Interrupt channel X Timeslot F data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_G       	0x0040		/*Interrupt channel X Timeslot G data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_H       	0x0080		/*Interrupt channel X Timeslot H data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_I       	0x0100		/*Interrupt channel X Timeslot I data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_J       	0x0200		/*Interrupt channel X Timeslot J data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_K       	0x0400		/*Interrupt channel X Timeslot K data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_DATA_L       	0x0800		/*Interrupt channel X Timeslot L data interrupt enable*/
#define BITM_INT_ENABLE_XD_INTX_EN_FIFO_OFLOW   	0x2000		/*FIFO overflow Interrupt enable for interrupt channel X*/
#define BITM_INT_ENABLE_XD_INTX_EN_FIFO_UFLOW   	0x4000		/*FIFO underflow Interrupt enable for interrupt channel X*/
#define BITM_INT_ENABLE_XD_INTX_EN_FIFO_TH      	0x8000		/*FIFO Threshold Interrupt Enable*/

