ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ENABLE_YD						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_A       	0			/*interrupt channel Y Timeslot A data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_B       	1			/*interrupt channel Y Timeslot B data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_C       	2			/*interrupt channel Y Timeslot C data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_D       	3			/*interrupt channel Y Timeslot D data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_E       	4			/*interrupt channel Y Timeslot E data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_F       	5			/*interrupt channel Y Timeslot F data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_G       	6			/*interrupt channel Y Timeslot G data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_H       	7			/*interrupt channel Y Timeslot H data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_I       	8			/*interrupt channel Y Timeslot I data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_J       	9			/*interrupt channel Y Timeslot J data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_K       	10			/*interrupt channel Y Timeslot K data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_DATA_L       	11			/*interrupt channel Y Timeslot L data interrupt enable*/
#define BITP_INT_ENABLE_YD_INTY_EN_FIFO_OFLOW   	13			/*FIFO overflow Interrupt enable for interrupt channel Y*/
#define BITP_INT_ENABLE_YD_INTY_EN_FIFO_UFLOW   	14			/*FIFO underflow Interrupt enable for interrupt channel Y*/
#define BITP_INT_ENABLE_YD_INTY_EN_FIFO_TH      	15			/*FIFO Threshold Interrupt Enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_A       	0x0001		/*interrupt channel Y Timeslot A data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_B       	0x0002		/*interrupt channel Y Timeslot B data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_C       	0x0004		/*interrupt channel Y Timeslot C data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_D       	0x0008		/*interrupt channel Y Timeslot D data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_E       	0x0010		/*interrupt channel Y Timeslot E data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_F       	0x0020		/*interrupt channel Y Timeslot F data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_G       	0x0040		/*interrupt channel Y Timeslot G data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_H       	0x0080		/*interrupt channel Y Timeslot H data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_I       	0x0100		/*interrupt channel Y Timeslot I data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_J       	0x0200		/*interrupt channel Y Timeslot J data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_K       	0x0400		/*interrupt channel Y Timeslot K data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_DATA_L       	0x0800		/*interrupt channel Y Timeslot L data interrupt enable*/
#define BITM_INT_ENABLE_YD_INTY_EN_FIFO_OFLOW   	0x2000		/*FIFO overflow Interrupt enable for interrupt channel Y*/
#define BITM_INT_ENABLE_YD_INTY_EN_FIFO_UFLOW   	0x4000		/*FIFO underflow Interrupt enable for interrupt channel Y*/
#define BITM_INT_ENABLE_YD_INTY_EN_FIFO_TH      	0x8000		/*FIFO Threshold Interrupt Enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ENABLE_XL0						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_A      	0			/*Interrupt channel X Timeslot A level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_B      	1			/*Interrupt channel X Timeslot B level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_C      	2			/*Interrupt channel X Timeslot C level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_D      	3			/*Interrupt channel X Timeslot D level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_E      	4			/*Interrupt channel X Timeslot E level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_F      	5			/*Interrupt channel X Timeslot F level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_G      	6			/*Interrupt channel X Timeslot G level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_H      	7			/*Interrupt channel X Timeslot H level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_I      	8			/*Interrupt channel X Timeslot I level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_J      	9			/*Interrupt channel X Timeslot J level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_K      	10			/*Interrupt channel X Timeslot K level 0 interrupt enable*/
#define BITP_INT_ENABLE_XL0_INTX_EN_LEV0_L      	11			/*Interrupt channel X Timeslot L level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_A      	0x0001		/*Interrupt channel X Timeslot A level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_B      	0x0002		/*Interrupt channel X Timeslot B level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_C      	0x0004		/*Interrupt channel X Timeslot C level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_D      	0x0008		/*Interrupt channel X Timeslot D level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_E      	0x0010		/*Interrupt channel X Timeslot E level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_F      	0x0020		/*Interrupt channel X Timeslot F level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_G      	0x0040		/*Interrupt channel X Timeslot G level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_H      	0x0080		/*Interrupt channel X Timeslot H level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_I      	0x0100		/*Interrupt channel X Timeslot I level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_J      	0x0200		/*Interrupt channel X Timeslot J level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_K      	0x0400		/*Interrupt channel X Timeslot K level 0 interrupt enable*/
#define BITM_INT_ENABLE_XL0_INTX_EN_LEV0_L      	0x0800		/*Interrupt channel X Timeslot L level 0 interrupt enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ENABLE_XL1						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_A      	0			/*Interrupt channel X Timeslot A level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_B      	1			/*Interrupt channel X Timeslot B level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_C      	2			/*Interrupt channel X Timeslot C level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_D      	3			/*Interrupt channel X Timeslot D level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_E      	4			/*Interrupt channel X Timeslot E level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_F      	5			/*Interrupt channel X Timeslot F level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_G      	6			/*Interrupt channel X Timeslot G level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_H      	7			/*Interrupt channel X Timeslot H level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_I      	8			/*Interrupt channel X Timeslot I level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_J      	9			/*Interrupt channel X Timeslot J level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_K      	10			/*Interrupt channel X Timeslot K level 1 interrupt enable*/
#define BITP_INT_ENABLE_XL1_INTX_EN_LEV1_L      	11			/*Interrupt channel X Timeslot L level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_A      	0x0001		/*Interrupt channel X Timeslot A level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_B      	0x0002		/*Interrupt channel X Timeslot B level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_C      	0x0004		/*Interrupt channel X Timeslot C level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_D      	0x0008		/*Interrupt channel X Timeslot D level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_E      	0x0010		/*Interrupt channel X Timeslot E level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_F      	0x0020		/*Interrupt channel X Timeslot F level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_G      	0x0040		/*Interrupt channel X Timeslot G level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_H      	0x0080		/*Interrupt channel X Timeslot H level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_I      	0x0100		/*Interrupt channel X Timeslot I level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_J      	0x0200		/*Interrupt channel X Timeslot J level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_K      	0x0400		/*Interrupt channel X Timeslot K level 1 interrupt enable*/
#define BITM_INT_ENABLE_XL1_INTX_EN_LEV1_L      	0x0800		/*Interrupt channel X Timeslot L level 1 interrupt enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ENABLE_YL0						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_A      	0			/*interrupt channel Y Timeslot A level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_B      	1			/*interrupt channel Y Timeslot B level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_C      	2			/*interrupt channel Y Timeslot C level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_D      	3			/*interrupt channel Y Timeslot D level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_E      	4			/*interrupt channel Y Timeslot E level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_F      	5			/*interrupt channel Y Timeslot F level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_G      	6			/*interrupt channel Y Timeslot G level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_H      	7			/*interrupt channel Y Timeslot H level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_I      	8			/*interrupt channel Y Timeslot I level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_J      	9			/*interrupt channel Y Timeslot J level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_K      	10			/*interrupt channel Y Timeslot K level 0 interrupt enable*/
#define BITP_INT_ENABLE_YL0_INTY_EN_LEV0_L      	11			/*interrupt channel Y Timeslot L level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_A      	0x0001		/*interrupt channel Y Timeslot A level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_B      	0x0002		/*interrupt channel Y Timeslot B level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_C      	0x0004		/*interrupt channel Y Timeslot C level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_D      	0x0008		/*interrupt channel Y Timeslot D level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_E      	0x0010		/*interrupt channel Y Timeslot E level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_F      	0x0020		/*interrupt channel Y Timeslot F level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_G      	0x0040		/*interrupt channel Y Timeslot G level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_H      	0x0080		/*interrupt channel Y Timeslot H level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_I      	0x0100		/*interrupt channel Y Timeslot I level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_J      	0x0200		/*interrupt channel Y Timeslot J level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_K      	0x0400		/*interrupt channel Y Timeslot K level 0 interrupt enable*/
#define BITM_INT_ENABLE_YL0_INTY_EN_LEV0_L      	0x0800		/*interrupt channel Y Timeslot L level 0 interrupt enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INT_ENABLE_YL1						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_A      	0			/*interrupt channel Y Timeslot A level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_B      	1			/*interrupt channel Y Timeslot B level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_C      	2			/*interrupt channel Y Timeslot C level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_D      	3			/*interrupt channel Y Timeslot D level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_E      	4			/*interrupt channel Y Timeslot E level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_F      	5			/*interrupt channel Y Timeslot F level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_G      	6			/*interrupt channel Y Timeslot G level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_H      	7			/*interrupt channel Y Timeslot H level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_I      	8			/*interrupt channel Y Timeslot I level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_J      	9			/*interrupt channel Y Timeslot J level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_K      	10			/*interrupt channel Y Timeslot K level 1 interrupt enable*/
#define BITP_INT_ENABLE_YL1_INTY_EN_LEV1_L      	11			/*interrupt channel Y Timeslot L level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_A      	0x0001		/*interrupt channel Y Timeslot A level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_B      	0x0002		/*interrupt channel Y Timeslot B level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_C      	0x0004		/*interrupt channel Y Timeslot C level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_D      	0x0008		/*interrupt channel Y Timeslot D level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_E      	0x0010		/*interrupt channel Y Timeslot E level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_F      	0x0020		/*interrupt channel Y Timeslot F level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_G      	0x0040		/*interrupt channel Y Timeslot G level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_H      	0x0080		/*interrupt channel Y Timeslot H level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_I      	0x0100		/*interrupt channel Y Timeslot I level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_J      	0x0200		/*interrupt channel Y Timeslot J level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_K      	0x0400		/*interrupt channel Y Timeslot K level 1 interrupt enable*/
#define BITM_INT_ENABLE_YL1_INTY_EN_LEV1_L      	0x0800		/*interrupt channel Y Timeslot L level 1 interrupt enable*/


/* -------------------------------------------------------------------------------------------------------------------------
				REG_FIFO_STATUS_BYTES						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_SUM     	0			/*Enable status summary byte.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_D1      	1			/*Enable data interrupt status byte lower.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_D2      	2			/*Enable data interrupt status byte upper.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_L0      	3			/*Enable level 0 interrupt status byte lower.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_L1      	4			/*Enable level 1 interrupt status byte lower.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_LX      	5			/*Enable level 0 and level 1 interrupt status byte upper.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_TS1     	6			/*Enable TIA sat chan 1 interrupt status byte lower.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_TS2     	7			/*Enable TIA sat chan 2 interrupt status byte lower.*/
#define BITP_FIFO_STATUS_BYTES_ENA_STAT_TSX     	8			/*Enable TIA sat chan 1/2 interrupt status byte upper.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_SUM     	0x0001		/*Enable status summary byte.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_D1      	0x0002		/*Enable data interrupt status byte lower.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_D2      	0x0004		/*Enable data interrupt status byte upper.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_L0      	0x0008		/*Enable level 0 interrupt status byte lower.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_L1      	0x0010		/*Enable level 1 interrupt status byte lower.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_LX      	0x0020		/*Enable level 0 and level 1 interrupt status byte upper.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_TS1     	0x0040		/*Enable TIA sat chan 1 interrupt status byte lower.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_TS2     	0x0080		/*Enable TIA sat chan 2 interrupt status byte lower.*/
#define BITM_FIFO_STATUS_BYTES_ENA_STAT_TSX     	0x0100		/*Enable TIA sat chan 1/2 interrupt status byte upper.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUT_SLEEP						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUT_SLEEP_INP_SLEEP_12           	0			/*Input pair sleep state for inputs 1 and 2*/
#define BITP_INPUT_SLEEP_INP_SLEEP_34           	4			/*Input pair sleep state for inputs 3 and 4*/
#define BITP_INPUT_SLEEP_INP_SLEEP_56           	8			/*Input pair sleep state for inputs 5 and 6*/
#define BITP_INPUT_SLEEP_INP_SLEEP_78           	12			/*Input pair sleep state for inputs 7 and 8*/
#define BITM_INPUT_SLEEP_INP_SLEEP_12           	0x000f		/*Input pair sleep state for inputs 1 and 2*/
#define BITM_INPUT_SLEEP_INP_SLEEP_34           	0x00f0		/*Input pair sleep state for inputs 3 and 4*/
#define BITM_INPUT_SLEEP_INP_SLEEP_56           	0x0f00		/*Input pair sleep state for inputs 5 and 6*/
#define BITM_INPUT_SLEEP_INP_SLEEP_78           	0xf000		/*Input pair sleep state for inputs 7 and 8*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUT_CFG						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUT_CFG_PAIR12                   	0			/*Input pair configuration*/
#define BITP_INPUT_CFG_PAIR34                   	1			/*Input pair configuration*/
#define BITP_INPUT_CFG_PAIR56                   	2			/*Input pair configuration*/
#define BITP_INPUT_CFG_PAIR78                   	3			/*Input pair configuration*/
#define BITP_INPUT_CFG_VC1_SLEEP                	4			/*Cathode1 sleep state*/
#define BITP_INPUT_CFG_VC2_SLEEP                	6			/*Cathode2 sleep state*/
#define BITM_INPUT_CFG_PAIR12                   	0x0001		/*Input pair configuration*/
#define BITM_INPUT_CFG_PAIR34                   	0x0002		/*Input pair configuration*/
#define BITM_INPUT_CFG_PAIR56                   	0x0004		/*Input pair configuration*/
#define BITM_INPUT_CFG_PAIR78                   	0x0008		/*Input pair configuration*/
#define BITM_INPUT_CFG_VC1_SLEEP                	0x0030		/*Cathode1 sleep state*/
#define BITM_INPUT_CFG_VC2_SLEEP                	0x00c0		/*Cathode2 sleep state*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_GPIO_CFG						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_CFG_GPIO_PIN_CFG0             	0			/*GPIO[0] Pin Configuration*/
#define BITP_GPIO_CFG_GPIO_PIN_CFG1             	3			/*GPIO[1] Pin Configuration*/
#define BITP_GPIO_CFG_GPIO_PIN_CFG2             	6			/*GPIO[2] Pin Configuration*/
#define BITP_GPIO_CFG_GPIO_PIN_CFG3             	9			/*GPIO[3] Pin Configuration*/
#define BITP_GPIO_CFG_GPIO_DRV                  	12			/*Drive Control for GPIO Pins*/
#define BITP_GPIO_CFG_GPIO_SLEW                 	14			/*Slew Control for GPIO Pins*/
#define BITM_GPIO_CFG_GPIO_PIN_CFG0             	0x0007		/*GPIO[0] Pin Configuration*/
#define BITM_GPIO_CFG_GPIO_PIN_CFG1             	0x0038		/*GPIO[1] Pin Configuration*/
#define BITM_GPIO_CFG_GPIO_PIN_CFG2             	0x01c0		/*GPIO[2] Pin Configuration*/
#define BITM_GPIO_CFG_GPIO_PIN_CFG3             	0x0e00		/*GPIO[3] Pin Configuration*/
#define BITM_GPIO_CFG_GPIO_DRV                  	0x3000		/*Drive Control for GPIO Pins*/
#define BITM_GPIO_CFG_GPIO_SLEW                 	0xc000		/*Slew Control for GPIO Pins*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_GPIO01						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_GPIO01_GPIOOUT0                    	0			/*GPIO Pin 0 Output Select*/
#define BITP_GPIO01_GPIOOUT1                    	8			/*GPIO Pin 1 Output Select*/
#define BITP_GPIO01_TIMESTAMP_INV               	14			/*Timestamp Trigger Invert*/
#define BITP_GPIO01_TIMESTAMP_ALWAYS_EN         	15			/*Enable Timestamp Always on*/
#define BITM_GPIO01_GPIOOUT0                    	0x001f		/*GPIO Pin 0 Output Select*/
#define BITM_GPIO01_GPIOOUT1                    	0x1f00		/*GPIO Pin 1 Output Select*/
#define BITM_GPIO01_TIMESTAMP_INV               	0x4000		/*Timestamp Trigger Invert*/
#define BITM_GPIO01_TIMESTAMP_ALWAYS_EN         	0x8000		/*Enable Timestamp Always on*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_GPIO23						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_GPIO23_GPIOOUT2                    	0			/*GPIO Pin 2 Output Select*/
#define BITP_GPIO23_GPIOOUT3                    	8			/*GPIO Pin 3 Output Select*/
#define BITP_GPIO23_EXT_SYNC_EN                 	14			/*External sync enable*/
#define BITM_GPIO23_GPIOOUT2                    	0x001f		/*GPIO Pin 2 Output Select*/
#define BITM_GPIO23_GPIOOUT3                    	0x1f00		/*GPIO Pin 3 Output Select*/
#define BITM_GPIO23_EXT_SYNC_EN                 	0x4000		/*External sync enable*/

