ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_GPIO_IN						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_IN_GPIO_INPUT                 	0			/*GPIO Input value (if enabled)*/
#define BITM_GPIO_IN_GPIO_INPUT                 	0x000f		/*GPIO Input value (if enabled)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA_HOLD_FLAG						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_A         	0			/*Prevent Update of Timeslot A data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_B         	1			/*Prevent Update of Timeslot B data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_C         	2			/*Prevent Update of Timeslot C data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_D         	3			/*Prevent Update of Timeslot D data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_E         	4			/*Prevent Update of Timeslot E data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_F         	5			/*Prevent Update of Timeslot F data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_G         	6			/*Prevent Update of Timeslot G data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_H         	7			/*Prevent Update of Timeslot H data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_I         	8			/*Prevent Update of Timeslot I data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_J         	9			/*Prevent Update of Timeslot J data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_K         	10			/*Prevent Update of Timeslot K data registers*/
#define BITP_DATA_HOLD_FLAG_HOLD_REGS_L         	11			/*Prevent Update of Timeslot L data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_A         	0x0001		/*Prevent Update of Timeslot A data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_B         	0x0002		/*Prevent Update of Timeslot B data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_C         	0x0004		/*Prevent Update of Timeslot C data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_D         	0x0008		/*Prevent Update of Timeslot D data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_E         	0x0010		/*Prevent Update of Timeslot E data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_F         	0x0020		/*Prevent Update of Timeslot F data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_G         	0x0040		/*Prevent Update of Timeslot G data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_H         	0x0080		/*Prevent Update of Timeslot H data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_I         	0x0100		/*Prevent Update of Timeslot I data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_J         	0x0200		/*Prevent Update of Timeslot J data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_K         	0x0400		/*Prevent Update of Timeslot K data registers*/
#define BITM_DATA_HOLD_FLAG_HOLD_REGS_L         	0x0800		/*Prevent Update of Timeslot L data registers*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_FIFO_DATA						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_FIFO_DATA_FIFO_DATA                	0			/*FIFO data port*/
#define BITM_FIFO_DATA_FIFO_DATA                	0xffff		/*FIFO data port*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_A_SIGNAL1_L_A            	0			/*Signal channel 1 lower half timeslot a*/
#define BITM_SIGNAL1_L_A_SIGNAL1_L_A            	0xffff		/*Signal channel 1 lower half timeslot a*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_A_SIGNAL1_H_A            	0			/*Signal channel 1 upper half timeslot a*/
#define BITM_SIGNAL1_H_A_SIGNAL1_H_A            	0xffff		/*Signal channel 1 upper half timeslot a*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_A_SIGNAL2_L_A            	0			/*Signal channel 2 lower half timeslot a*/
#define BITM_SIGNAL2_L_A_SIGNAL2_L_A            	0xffff		/*Signal channel 2 lower half timeslot a*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_A_SIGNAL2_H_A            	0			/*Signal channel 2 upper half timeslot a*/
#define BITM_SIGNAL2_H_A_SIGNAL2_H_A            	0xffff		/*Signal channel 2 upper half timeslot a*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_A_DARK1_L_A                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_A_DARK1_L_A                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_A_DARK1_H_A                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_A_DARK1_H_A                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_A_DARK2_L_A                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_A_DARK2_L_A                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_A_DARK2_H_A                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_A_DARK2_H_A                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_B_SIGNAL1_L_B            	0			/*Signal channel 1 lower half timeslot b*/
#define BITM_SIGNAL1_L_B_SIGNAL1_L_B            	0xffff		/*Signal channel 1 lower half timeslot b*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_B_SIGNAL1_H_B            	0			/*Signal channel 1 upper half timeslot b*/
#define BITM_SIGNAL1_H_B_SIGNAL1_H_B            	0xffff		/*Signal channel 1 upper half timeslot b*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_B_SIGNAL2_L_B            	0			/*Signal channel 2 lower half timeslot b*/
#define BITM_SIGNAL2_L_B_SIGNAL2_L_B            	0xffff		/*Signal channel 2 lower half timeslot b*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_B_SIGNAL2_H_B            	0			/*Signal channel 2 upper half timeslot b*/
#define BITM_SIGNAL2_H_B_SIGNAL2_H_B            	0xffff		/*Signal channel 2 upper half timeslot b*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_B_DARK1_L_B                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_B_DARK1_L_B                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_B_DARK1_H_B                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_B_DARK1_H_B                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_B_DARK2_L_B                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_B_DARK2_L_B                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_B						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_B_DARK2_H_B                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_B_DARK2_H_B                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_C_SIGNAL1_L_C            	0			/*Signal channel 1 lower half timeslot c*/
#define BITM_SIGNAL1_L_C_SIGNAL1_L_C            	0xffff		/*Signal channel 1 lower half timeslot c*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_C_SIGNAL1_H_C            	0			/*Signal channel 1 upper half timeslot c*/
#define BITM_SIGNAL1_H_C_SIGNAL1_H_C            	0xffff		/*Signal channel 1 upper half timeslot c*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_C_SIGNAL2_L_C            	0			/*Signal channel 2 lower half timeslot c*/
#define BITM_SIGNAL2_L_C_SIGNAL2_L_C            	0xffff		/*Signal channel 2 lower half timeslot c*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_C_SIGNAL2_H_C            	0			/*Signal channel 2 upper half timeslot c*/
#define BITM_SIGNAL2_H_C_SIGNAL2_H_C            	0xffff		/*Signal channel 2 upper half timeslot c*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_C_DARK1_L_C                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_C_DARK1_L_C                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_C_DARK1_H_C                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_C_DARK1_H_C                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_C_DARK2_L_C                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_C_DARK2_L_C                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_C						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_C_DARK2_H_C                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_C_DARK2_H_C                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_D_SIGNAL1_L_D            	0			/*Signal channel 1 lower half timeslot d*/
#define BITM_SIGNAL1_L_D_SIGNAL1_L_D            	0xffff		/*Signal channel 1 lower half timeslot d*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_D_SIGNAL1_H_D            	0			/*Signal channel 1 upper half timeslot d*/
#define BITM_SIGNAL1_H_D_SIGNAL1_H_D            	0xffff		/*Signal channel 1 upper half timeslot d*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_D_SIGNAL2_L_D            	0			/*Signal channel 2 lower half timeslot d*/
#define BITM_SIGNAL2_L_D_SIGNAL2_L_D            	0xffff		/*Signal channel 2 lower half timeslot d*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_D_SIGNAL2_H_D            	0			/*Signal channel 2 upper half timeslot d*/
#define BITM_SIGNAL2_H_D_SIGNAL2_H_D            	0xffff		/*Signal channel 2 upper half timeslot d*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_D_DARK1_L_D                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_D_DARK1_L_D                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_D_DARK1_H_D                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_D_DARK1_H_D                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_D_DARK2_L_D                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_D_DARK2_L_D                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_D_DARK2_H_D                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_D_DARK2_H_D                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_E_SIGNAL1_L_E            	0			/*Signal channel 1 lower half timeslot e*/
#define BITM_SIGNAL1_L_E_SIGNAL1_L_E            	0xffff		/*Signal channel 1 lower half timeslot e*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_E_SIGNAL1_H_E            	0			/*Signal channel 1 upper half timeslot e*/
#define BITM_SIGNAL1_H_E_SIGNAL1_H_E            	0xffff		/*Signal channel 1 upper half timeslot e*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_E_SIGNAL2_L_E            	0			/*Signal channel 2 lower half timeslot e*/
#define BITM_SIGNAL2_L_E_SIGNAL2_L_E            	0xffff		/*Signal channel 2 lower half timeslot e*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_E_SIGNAL2_H_E            	0			/*Signal channel 2 upper half timeslot e*/
#define BITM_SIGNAL2_H_E_SIGNAL2_H_E            	0xffff		/*Signal channel 2 upper half timeslot e*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_E_DARK1_L_E                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_E_DARK1_L_E                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_E_DARK1_H_E                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_E_DARK1_H_E                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_E_DARK2_L_E                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_E_DARK2_L_E                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_E_DARK2_H_E                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_E_DARK2_H_E                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_F_SIGNAL1_L_F            	0			/*Signal channel 1 lower half timeslot f*/
#define BITM_SIGNAL1_L_F_SIGNAL1_L_F            	0xffff		/*Signal channel 1 lower half timeslot f*/

