ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_F_SIGNAL1_H_F            	0			/*Signal channel 1 upper half timeslot f*/
#define BITM_SIGNAL1_H_F_SIGNAL1_H_F            	0xffff		/*Signal channel 1 upper half timeslot f*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_F_SIGNAL2_L_F            	0			/*Signal channel 2 lower half timeslot f*/
#define BITM_SIGNAL2_L_F_SIGNAL2_L_F            	0xffff		/*Signal channel 2 lower half timeslot f*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_F_SIGNAL2_H_F            	0			/*Signal channel 2 upper half timeslot f*/
#define BITM_SIGNAL2_H_F_SIGNAL2_H_F            	0xffff		/*Signal channel 2 upper half timeslot f*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_F_DARK1_L_F                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_F_DARK1_L_F                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_F_DARK1_H_F                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_F_DARK1_H_F                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_F_DARK2_L_F                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_F_DARK2_L_F                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_F_DARK2_H_F                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_F_DARK2_H_F                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_G_SIGNAL1_L_G            	0			/*Signal channel 1 lower half timeslot g*/
#define BITM_SIGNAL1_L_G_SIGNAL1_L_G            	0xffff		/*Signal channel 1 lower half timeslot g*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_G_SIGNAL1_H_G            	0			/*Signal channel 1 upper half timeslot g*/
#define BITM_SIGNAL1_H_G_SIGNAL1_H_G            	0xffff		/*Signal channel 1 upper half timeslot g*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_G_SIGNAL2_L_G            	0			/*Signal channel 2 lower half timeslot g*/
#define BITM_SIGNAL2_L_G_SIGNAL2_L_G            	0xffff		/*Signal channel 2 lower half timeslot g*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_G_SIGNAL2_H_G            	0			/*Signal channel 2 upper half timeslot g*/
#define BITM_SIGNAL2_H_G_SIGNAL2_H_G            	0xffff		/*Signal channel 2 upper half timeslot g*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_G_DARK1_L_G                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_G_DARK1_L_G                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_G_DARK1_H_G                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_G_DARK1_H_G                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_G_DARK2_L_G                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_G_DARK2_L_G                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_G_DARK2_H_G                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_G_DARK2_H_G                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_H_SIGNAL1_L_H            	0			/*Signal channel 1 lower half timeslot h*/
#define BITM_SIGNAL1_L_H_SIGNAL1_L_H            	0xffff		/*Signal channel 1 lower half timeslot h*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_H_SIGNAL1_H_H            	0			/*Signal channel 1 upper half timeslot h*/
#define BITM_SIGNAL1_H_H_SIGNAL1_H_H            	0xffff		/*Signal channel 1 upper half timeslot h*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_H_SIGNAL2_L_H            	0			/*Signal channel 2 lower half timeslot h*/
#define BITM_SIGNAL2_L_H_SIGNAL2_L_H            	0xffff		/*Signal channel 2 lower half timeslot h*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_H_SIGNAL2_H_H            	0			/*Signal channel 2 upper half timeslot h*/
#define BITM_SIGNAL2_H_H_SIGNAL2_H_H            	0xffff		/*Signal channel 2 upper half timeslot h*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_H_DARK1_L_H                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_H_DARK1_L_H                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_H_DARK1_H_H                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_H_DARK1_H_H                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_H_DARK2_L_H                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_H_DARK2_L_H                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_H_DARK2_H_H                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_H_DARK2_H_H                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_I_SIGNAL1_L_I            	0			/*Signal channel 1 lower half timeslot i*/
#define BITM_SIGNAL1_L_I_SIGNAL1_L_I            	0xffff		/*Signal channel 1 lower half timeslot i*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_I_SIGNAL1_H_I            	0			/*Signal channel 1 upper half timeslot i*/
#define BITM_SIGNAL1_H_I_SIGNAL1_H_I            	0xffff		/*Signal channel 1 upper half timeslot i*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_I_SIGNAL2_L_I            	0			/*Signal channel 2 lower half timeslot i*/
#define BITM_SIGNAL2_L_I_SIGNAL2_L_I            	0xffff		/*Signal channel 2 lower half timeslot i*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_I_SIGNAL2_H_I            	0			/*Signal channel 2 upper half timeslot i*/
#define BITM_SIGNAL2_H_I_SIGNAL2_H_I            	0xffff		/*Signal channel 2 upper half timeslot i*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_I_DARK1_L_I                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_I_DARK1_L_I                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_I_DARK1_H_I                	0			/*Dark channel 1 value upper half*/
#define BITM_DARK1_H_I_DARK1_H_I                	0xffff		/*Dark channel 1 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_I_DARK2_L_I                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_I_DARK2_L_I                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_I_DARK2_H_I                	0			/*Dark channel 2 value upper half*/
#define BITM_DARK2_H_I_DARK2_H_I                	0xffff		/*Dark channel 2 value upper half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_J_SIGNAL1_L_J            	0			/*Signal channel 1 lower half timeslot j*/
#define BITM_SIGNAL1_L_J_SIGNAL1_L_J            	0xffff		/*Signal channel 1 lower half timeslot j*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_J_SIGNAL1_H_J            	0			/*Signal channel 1 upper half timeslot j*/
#define BITM_SIGNAL1_H_J_SIGNAL1_H_J            	0xffff		/*Signal channel 1 upper half timeslot j*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_J_SIGNAL2_L_J            	0			/*Signal channel 2 lower half timeslot j*/
#define BITM_SIGNAL2_L_J_SIGNAL2_L_J            	0xffff		/*Signal channel 2 lower half timeslot j*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_J_SIGNAL2_H_J            	0			/*Signal channel 2 upper half timeslot j*/
#define BITM_SIGNAL2_H_J_SIGNAL2_H_J            	0xffff		/*Signal channel 2 upper half timeslot j*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_J_DARK1_L_J                	0			/*Dark channel 1 value lower half*/
#define BITM_DARK1_L_J_DARK1_L_J                	0xffff		/*Dark channel 1 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_J_DARK1_H_J                	0			/*Dark channel 1 value upper half timeslot j*/
#define BITM_DARK1_H_J_DARK1_H_J                	0xffff		/*Dark channel 1 value upper half timeslot j*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_J_DARK2_L_J                	0			/*Dark channel 2 value lower half*/
#define BITM_DARK2_L_J_DARK2_L_J                	0xffff		/*Dark channel 2 value lower half*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_J_DARK2_H_J                	0			/*Dark channel 2 value upper half timeslot j*/
#define BITM_DARK2_H_J_DARK2_H_J                	0xffff		/*Dark channel 2 value upper half timeslot j*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_K_SIGNAL1_L_K            	0			/*Signal channel 1 lower half timeslot k*/
#define BITM_SIGNAL1_L_K_SIGNAL1_L_K            	0xffff		/*Signal channel 1 lower half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_K_SIGNAL1_H_K            	0			/*Signal channel 1 upper half timeslot k*/
#define BITM_SIGNAL1_H_K_SIGNAL1_H_K            	0xffff		/*Signal channel 1 upper half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_K_SIGNAL2_L_K            	0			/*Signal channel 2 lower half timeslot k*/
#define BITM_SIGNAL2_L_K_SIGNAL2_L_K            	0xffff		/*Signal channel 2 lower half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_K_SIGNAL2_H_K            	0			/*Signal channel 2 upper half timeslot k*/
#define BITM_SIGNAL2_H_K_SIGNAL2_H_K            	0xffff		/*Signal channel 2 upper half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_K_DARK1_L_K                	0			/*Dark channel 1 value lower half timeslot k*/
#define BITM_DARK1_L_K_DARK1_L_K                	0xffff		/*Dark channel 1 value lower half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_K_DARK1_H_K                	0			/*Dark channel 1 value upper half timeslot k*/
#define BITM_DARK1_H_K_DARK1_H_K                	0xffff		/*Dark channel 1 value upper half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_K_DARK2_L_K                	0			/*Dark channel 2 value lower half timeslot k*/
#define BITM_DARK2_L_K_DARK2_L_K                	0xffff		/*Dark channel 2 value lower half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_K_DARK2_H_K                	0			/*Dark channel 2 value upper half timeslot k*/
#define BITM_DARK2_H_K_DARK2_H_K                	0xffff		/*Dark channel 2 value upper half timeslot k*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_L_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_L_L_SIGNAL1_L_L            	0			/*Signal channel 1 lower half timeslot l*/
#define BITM_SIGNAL1_L_L_SIGNAL1_L_L            	0xffff		/*Signal channel 1 lower half timeslot l*/

