ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL1_H_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL1_H_L_SIGNAL1_H_L            	0			/*Signal channel 1 upper half timeslot l*/
#define BITM_SIGNAL1_H_L_SIGNAL1_H_L            	0xffff		/*Signal channel 1 upper half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_L_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_L_L_SIGNAL2_L_L            	0			/*Signal channel 2 lower half timeslot l*/
#define BITM_SIGNAL2_L_L_SIGNAL2_L_L            	0xffff		/*Signal channel 2 lower half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_SIGNAL2_H_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SIGNAL2_H_L_SIGNAL2_H_L            	0			/*Signal channel 2 upper half timeslot l*/
#define BITM_SIGNAL2_H_L_SIGNAL2_H_L            	0xffff		/*Signal channel 2 upper half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_L_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_L_L_DARK1_L_L                	0			/*Dark channel 1 value lower half timeslot l*/
#define BITM_DARK1_L_L_DARK1_L_L                	0xffff		/*Dark channel 1 value lower half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK1_H_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK1_H_L_DARK1_H_L                	0			/*Dark channel 1 value upper half timeslot l*/
#define BITM_DARK1_H_L_DARK1_H_L                	0xffff		/*Dark channel 1 value upper half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_L_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_L_L_DARK2_L_L                	0			/*Dark channel 2 value lower half timeslot l*/
#define BITM_DARK2_L_L_DARK2_L_L                	0xffff		/*Dark channel 2 value lower half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DARK2_H_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DARK2_H_L_DARK2_H_L                	0			/*Dark channel 2 value upper half timeslot l*/
#define BITM_DARK2_H_L_DARK2_H_L                	0xffff		/*Dark channel 2 value upper half timeslot l*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_EFUSE						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_EFUSE_EFUSE_REG_EN                 	0			/*Efuse register access enable*/
#define BITP_EFUSE_EFUSE_EN                     	1			/*Efuse Enable*/
#define BITM_EFUSE_EFUSE_REG_EN                 	0x0001		/*Efuse register access enable*/
#define BITM_EFUSE_EFUSE_EN                     	0x0006		/*Efuse Enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_CTRL1						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_CTRL1_ADC_GAIN                 	0			/*Thermometric control code*/
#define BITP_ADC_CTRL1_ADC_SHORT                	8			/*Thermometric control code*/
#define BITM_ADC_CTRL1_ADC_GAIN                 	0x00ff		/*Thermometric control code*/
#define BITM_ADC_CTRL1_ADC_SHORT                	0xff00		/*Thermometric control code*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_CTRL2						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_CTRL2_ADC_RANGE                	0			/*Control input range of ADC*/
#define BITP_ADC_CTRL2_ADC_BAND                 	2			/*Band-limit the ADC to reduce noise*/
#define BITP_ADC_CTRL2_ADC_DELAY                	4			/*Test mode related to band-limiting*/
#define BITP_ADC_CTRL2_ADC_A_DEL                	5			/*adc_a_del*/
#define BITP_ADC_CTRL2_ADC_B_DEL                	6			/*adc_b_del*/
#define BITP_ADC_CTRL2_ADC_C_DEL                	7			/*adc_c_del*/
#define BITM_ADC_CTRL2_ADC_RANGE                	0x0003		/*Control input range of ADC*/
#define BITM_ADC_CTRL2_ADC_BAND                 	0x000c		/*Band-limit the ADC to reduce noise*/
#define BITM_ADC_CTRL2_ADC_DELAY                	0x0010		/*Test mode related to band-limiting*/
#define BITM_ADC_CTRL2_ADC_A_DEL                	0x0020		/*adc_a_del*/
#define BITM_ADC_CTRL2_ADC_B_DEL                	0x0040		/*adc_b_del*/
#define BITM_ADC_CTRL2_ADC_C_DEL                	0x0080		/*adc_c_del*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_POST						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_POST_DIFFN_PDIFF               	0			/*ADC_TM_DIFFN_PDIFF*/
#define BITP_ADC_POST_CONV_START                	2			/*Register control for conv_start*/
#define BITP_ADC_POST_CONV_FROMINT              	3			/*Conv_start select control*/
#define BITP_ADC_POST_ADC_RETIME_EDGE           	4			/*Retime edge selection*/
#define BITP_ADC_POST_ADC_PIPE                  	8			/*Adjust sample clock timing*/
#define BITP_ADC_POST_ADC_TESTMODE              	10			/*ADC test mode*/
#define BITP_ADC_POST_ADC_INPUT_SHORT           	12			/*ADC input short duration*/
#define BITP_ADC_POST_ADC_DUMMY_CYCLE           	14			/*Insert extra dummy cycle before first channel conversion*/
#define BITM_ADC_POST_DIFFN_PDIFF               	0x0001		/*ADC_TM_DIFFN_PDIFF*/
#define BITM_ADC_POST_CONV_START                	0x0004		/*Register control for conv_start*/
#define BITM_ADC_POST_CONV_FROMINT              	0x0008		/*Conv_start select control*/
#define BITM_ADC_POST_ADC_RETIME_EDGE           	0x0010		/*Retime edge selection*/
#define BITM_ADC_POST_ADC_PIPE                  	0x0300		/*Adjust sample clock timing*/
#define BITM_ADC_POST_ADC_TESTMODE              	0x0c00		/*ADC test mode*/
#define BITM_ADC_POST_ADC_INPUT_SHORT           	0x3000		/*ADC input short duration*/
#define BITM_ADC_POST_ADC_DUMMY_CYCLE           	0x4000		/*Insert extra dummy cycle before first channel conversion*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_REF_CTRL						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_REF_CTRL_REF_ABS                   	0			/*Trim REF output value*/
#define BITP_REF_CTRL_REF_LIMIT                 	9			/*Control charging time*/
#define BITP_REF_CTRL_REF_TM                    	10			/*MUX test points*/
#define BITM_REF_CTRL_REF_ABS                   	0x00ff		/*Trim REF output value*/
#define BITM_REF_CTRL_REF_LIMIT                 	0x0200		/*Control charging time*/
#define BITM_REF_CTRL_REF_TM                    	0x0c00		/*MUX test points*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_BIAS_CTRL						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_BIAS_CTRL_BIAS_I5U1_PD             	0			/*Power down of 5uA output1 for adc*/
#define BITP_BIAS_CTRL_BIAS_I5U2_PD             	1			/*Power down of 5uA output2 for adc*/
#define BITP_BIAS_CTRL_BIAS_I5U3_PD             	2			/*Power down of 5uA output3 for vref*/
#define BITP_BIAS_CTRL_BIAS_I5U4_PD             	3			/*Power down of 5uA output4 for vref*/
#define BITP_BIAS_CTRL_BIAS_I10U1_PD            	4			/*Power down of 10uA output1 for TBD*/
#define BITP_BIAS_CTRL_BIAS_I10U2_PD            	5			/*Power down of 10uA output2 for TBD*/
#define BITP_BIAS_CTRL_BIAS_I10U3_PD            	6			/*Power down of 10uA output3 for LED Driver*/
#define BITP_BIAS_CTRL_BIAS_I10U4_PD            	7			/*Power down of 10uA output4 for LED Driver*/
#define BITP_BIAS_CTRL_BIAS_I10U5_PD            	8			/*Power down of 10uA output5 AFE Vref*/
#define BITP_BIAS_CTRL_BIAS_I10U6_PD            	9			/*Power down of 10uA output6 for VICM*/
#define BITP_BIAS_CTRL_BIAS_I50U_PD             	10			/*Power down of 50uA output*/
#define BITP_BIAS_CTRL_BIAS_TEST                	11			/*Output of 10uA test current*/
#define BITP_BIAS_CTRL_AFE_HALF_CURRENT         	12			/*Set TIA, BPF, or INT to half bias current.*/
#define BITM_BIAS_CTRL_BIAS_I5U1_PD             	0x0001		/*Power down of 5uA output1 for adc*/
#define BITM_BIAS_CTRL_BIAS_I5U2_PD             	0x0002		/*Power down of 5uA output2 for adc*/
#define BITM_BIAS_CTRL_BIAS_I5U3_PD             	0x0004		/*Power down of 5uA output3 for vref*/
#define BITM_BIAS_CTRL_BIAS_I5U4_PD             	0x0008		/*Power down of 5uA output4 for vref*/
#define BITM_BIAS_CTRL_BIAS_I10U1_PD            	0x0010		/*Power down of 10uA output1 for TBD*/
#define BITM_BIAS_CTRL_BIAS_I10U2_PD            	0x0020		/*Power down of 10uA output2 for TBD*/
#define BITM_BIAS_CTRL_BIAS_I10U3_PD            	0x0040		/*Power down of 10uA output3 for LED Driver*/
#define BITM_BIAS_CTRL_BIAS_I10U4_PD            	0x0080		/*Power down of 10uA output4 for LED Driver*/
#define BITM_BIAS_CTRL_BIAS_I10U5_PD            	0x0100		/*Power down of 10uA output5 AFE Vref*/
#define BITM_BIAS_CTRL_BIAS_I10U6_PD            	0x0200		/*Power down of 10uA output6 for VICM*/
#define BITM_BIAS_CTRL_BIAS_I50U_PD             	0x0400		/*Power down of 50uA output*/
#define BITM_BIAS_CTRL_BIAS_TEST                	0x0800		/*Output of 10uA test current*/
#define BITM_BIAS_CTRL_AFE_HALF_CURRENT         	0x7000		/*Set TIA, BPF, or INT to half bias current.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_BIAS_TRIM1						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_BIAS_TRIM1_BIAS_TRIM10U5           	0			/*Bias trim 10uA for AFE VREF*/
#define BITP_BIAS_TRIM1_BIAS_TRIM10U6           	2			/*Bias trim 10uA for VICM*/
#define BITP_BIAS_TRIM1_BIAS_ATRIM              	4			/*Trim all bias current outputs (50uA, 10uA and 5uA)*/
#define BITP_BIAS_TRIM1_BIAS_TRIM50U            	8			/*Trim 50uA output*/
#define BITP_BIAS_TRIM1_AFE_TRIM_50U            	11			/*Bias trim for 50u AFE current.*/
#define BITM_BIAS_TRIM1_BIAS_TRIM10U5           	0x0003		/*Bias trim 10uA for AFE VREF*/
#define BITM_BIAS_TRIM1_BIAS_TRIM10U6           	0x000c		/*Bias trim 10uA for VICM*/
#define BITM_BIAS_TRIM1_BIAS_ATRIM              	0x0070		/*Trim all bias current outputs (50uA, 10uA and 5uA)*/
#define BITM_BIAS_TRIM1_BIAS_TRIM50U            	0x0700		/*Trim 50uA output*/
#define BITM_BIAS_TRIM1_AFE_TRIM_50U            	0xf800		/*Bias trim for 50u AFE current.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_BIAS_TRIM2						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_BIAS_TRIM2_BIAS_TRIM5U1            	0			/*Trim bias for ADC*/
#define BITP_BIAS_TRIM2_BIAS_TRIM5U2            	2			/*Trim bias for ADC*/
#define BITP_BIAS_TRIM2_BIAS_TRIM5U3            	4			/*Trim bias for REF*/
#define BITP_BIAS_TRIM2_BIAS_TRIM5U4            	6			/*Trim bias for REF*/
#define BITP_BIAS_TRIM2_BIAS_TRIM10U1           	8			/*Trim bias for TBD*/
#define BITP_BIAS_TRIM2_BIAS_TRIM10U2           	10			/*Trim bias to TBD*/
#define BITP_BIAS_TRIM2_BIAS_TRIM10U3           	12			/*Trim bias for LED driver*/
#define BITP_BIAS_TRIM2_BIAS_TRIM10U4           	14			/*Trim bias for LED driver*/
#define BITM_BIAS_TRIM2_BIAS_TRIM5U1            	0x0003		/*Trim bias for ADC*/
#define BITM_BIAS_TRIM2_BIAS_TRIM5U2            	0x000c		/*Trim bias for ADC*/
#define BITM_BIAS_TRIM2_BIAS_TRIM5U3            	0x0030		/*Trim bias for REF*/
#define BITM_BIAS_TRIM2_BIAS_TRIM5U4            	0x00c0		/*Trim bias for REF*/
#define BITM_BIAS_TRIM2_BIAS_TRIM10U1           	0x0300		/*Trim bias for TBD*/
#define BITM_BIAS_TRIM2_BIAS_TRIM10U2           	0x0c00		/*Trim bias to TBD*/
#define BITM_BIAS_TRIM2_BIAS_TRIM10U3           	0x3000		/*Trim bias for LED driver*/
#define BITM_BIAS_TRIM2_BIAS_TRIM10U4           	0xc000		/*Trim bias for LED driver*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_BG_CTRL						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_BG_CTRL_BG_TRIM                    	0			/*Trim bandgap current output*/
#define BITP_BG_CTRL_AFE_TRIM_BPF               	4			/*Global bpf trim*/
#define BITM_BG_CTRL_BG_TRIM                    	0x000f		/*Trim bandgap current output*/
#define BITM_BG_CTRL_AFE_TRIM_BPF               	0x0030		/*Global bpf trim*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_POWER_FRC						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_POWER_FRC_PWR_TIA1             	0			/*Channel1 TIA Amp power force control*/
#define BITP_AFE_POWER_FRC_PWR_TIA2             	2			/*Channel2 TIA Amp power force control*/
#define BITP_AFE_POWER_FRC_PWR_INT1             	4			/*Channel1 Integrator Amp power force control*/
#define BITP_AFE_POWER_FRC_PWR_INT2             	6			/*Channel2 Integrator Amp power force control*/
#define BITP_AFE_POWER_FRC_PWR_BPF1             	8			/*Channel1 BPF Amp power force control*/
#define BITP_AFE_POWER_FRC_PWR_BPF2             	10			/*Channel2 BPF Amp power force control*/
#define BITP_AFE_POWER_FRC_PWR_AFE_VREF         	12			/*AFE vref power force control*/
#define BITP_AFE_POWER_FRC_PWR_VICMREF          	14			/*Channel2 TIA Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_TIA1             	0x0003		/*Channel1 TIA Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_TIA2             	0x000c		/*Channel2 TIA Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_INT1             	0x0030		/*Channel1 Integrator Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_INT2             	0x00c0		/*Channel2 Integrator Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_BPF1             	0x0300		/*Channel1 BPF Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_BPF2             	0x0c00		/*Channel2 BPF Amp power force control*/
#define BITM_AFE_POWER_FRC_PWR_AFE_VREF         	0x3000		/*AFE vref power force control*/
#define BITM_AFE_POWER_FRC_PWR_VICMREF          	0xc000		/*Channel2 TIA Amp power force control*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_REF_POWER_FRC						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_REF_POWER_FRC_PWR_BG               	0			/*Bandgap power force control*/
#define BITP_REF_POWER_FRC_PWR_BIAS             	2			/*Bias distribution power force control*/
#define BITP_REF_POWER_FRC_PWR_ADC              	4			/*ADC power force control*/
#define BITP_REF_POWER_FRC_PWR_ADC_VREF         	6			/*ADC vref power force control*/
#define BITM_REF_POWER_FRC_PWR_BG               	0x0003		/*Bandgap power force control*/
#define BITM_REF_POWER_FRC_PWR_BIAS             	0x000c		/*Bias distribution power force control*/
#define BITM_REF_POWER_FRC_PWR_ADC              	0x0030		/*ADC power force control*/
#define BITM_REF_POWER_FRC_PWR_ADC_VREF         	0x00c0		/*ADC vref power force control*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POWER_FRC						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POWER_FRC_PWR_LED1A            	0			/*Led1A Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED1B            	2			/*Led1B Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED2A            	4			/*Led2A Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED2B            	6			/*Led2B Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED3A            	8			/*Led3A Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED3B            	10			/*Led3B Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED4A            	12			/*Led4A Amp  power force control*/
#define BITP_LED_POWER_FRC_PWR_LED4B            	14			/*Led4B Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED1A            	0x0003		/*Led1A Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED1B            	0x000c		/*Led1B Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED2A            	0x0030		/*Led2A Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED2B            	0x00c0		/*Led2B Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED3A            	0x0300		/*Led3A Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED3B            	0x0c00		/*Led3B Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED4A            	0x3000		/*Led4A Amp  power force control*/
#define BITM_LED_POWER_FRC_PWR_LED4B            	0xc000		/*Led4B Amp  power force control*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_TRIM						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_TRIM_LED1_ISEL                 	0			/*Led slew control for LED1 output pair*/
#define BITP_LED_TRIM_LED2_ISEL                 	2			/*Led slew control for LED2 output pair*/
#define BITP_LED_TRIM_LED3_ISEL                 	4			/*Led slew control for LED3 output pair*/
#define BITP_LED_TRIM_LED4_ISEL                 	6			/*Led slew control for LED4 output pair*/
#define BITM_LED_TRIM_LED1_ISEL                 	0x0003		/*Led slew control for LED1 output pair*/
#define BITM_LED_TRIM_LED2_ISEL                 	0x000c		/*Led slew control for LED2 output pair*/
#define BITM_LED_TRIM_LED3_ISEL                 	0x0030		/*Led slew control for LED3 output pair*/
#define BITM_LED_TRIM_LED4_ISEL                 	0x00c0		/*Led slew control for LED4 output pair*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_A_TIMESLOT_OFFSET_A        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_A_INPUT_R_SELECT_A         	10			/*Input resistor select*/
#define BITP_TS_CTRL_A_SAMPLE_TYPE_A            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_A_CH2_EN_A                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_A_TIMESLOT_OFFSET_A        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_A_INPUT_R_SELECT_A         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_A_SAMPLE_TYPE_A            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_A_CH2_EN_A                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_A_AFE_PATH_CFG_A           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_A_PRE_WIDTH_A              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_A_AFE_PATH_CFG_A           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_A_PRE_WIDTH_A              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_A						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_A_INP12_A                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_A_INP34_A                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_A_INP56_A                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_A_INP78_A                   	12			/*input pair78 enable*/
#define BITM_INPUTS_A_INP12_A                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_A_INP34_A                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_A_INP56_A                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_A_INP78_A                   	0xf000		/*input pair78 enable*/

