ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_D_INTEG_OFFSET_D      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_D_INTEG_FINE_OFFSET_D 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_D_INTEG_OFFSET_D      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_D_INTEG_FINE_OFFSET_D 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_D_MOD_OFFSET_D           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_D_MOD_WIDTH_D            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_D_MOD_OFFSET_D           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_D_MOD_WIDTH_D            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_D_REVERSE_INTEG_D          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_D_SUBTRACT_D               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_D_MOD_DISABLE_D            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_D_LED_DISABLE_D            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_D_REVERSE_INTEG_D          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_D_SUBTRACT_D               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_D_MOD_DISABLE_D            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_D_LED_DISABLE_D            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_D_CH1_ADC_ADJUST_D        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_D_CH1_ADC_ADJUST_D        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_D_CH2_ADC_ADJUST_D        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_D_CH2_ADC_ADJUST_D        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_D_SIGNAL_SIZE_D              	0			/*Signal data size*/
#define BITP_DATA1_D_SIGNAL_SHIFT_D             	3			/*Signal data shift*/
#define BITP_DATA1_D_DARK_SIZE_D                	8			/*Dark data size*/
#define BITP_DATA1_D_DARK_SHIFT_D               	11			/*Dark data shift*/
#define BITM_DATA1_D_SIGNAL_SIZE_D              	0x0007		/*Signal data size*/
#define BITM_DATA1_D_SIGNAL_SHIFT_D             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_D_DARK_SIZE_D                	0x0700		/*Dark data size*/
#define BITM_DATA1_D_DARK_SHIFT_D               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_D_LIT_SIZE_D                 	0			/*Lit data size*/
#define BITP_DATA2_D_LIT_SHIFT_D                	3			/*Lit data shift*/
#define BITM_DATA2_D_LIT_SIZE_D                 	0x0007		/*Lit data size*/
#define BITM_DATA2_D_LIT_SHIFT_D                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_D_DECIMATE_TYPE_D         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_D_DECIMATE_FACTOR_D       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_D_DECIMATE_TYPE_D         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_D_DECIMATE_FACTOR_D       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_D_LIT_OFFSET_D          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_D_LIT_OFFSET_D          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_D_DARK1_OFFSET_D       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_D_DARK2_OFFSET_D       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_D_DARK1_OFFSET_D       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_D_DARK2_OFFSET_D       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_D_THRESH0_TYPE_D        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_D_THRESH0_DIR_D         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_D_THRESH0_CHAN_D        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_D_THRESH1_TYPE_D        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_D_THRESH1_DIR_D         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_D_THRESH1_CHAN_D        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_D_THRESH0_TYPE_D        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_D_THRESH0_DIR_D         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_D_THRESH0_CHAN_D        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_D_THRESH1_TYPE_D        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_D_THRESH1_DIR_D         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_D_THRESH1_CHAN_D        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_D_THRESH0_VALUE_D          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_D_THRESH0_SHIFT_D          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_D_THRESH0_VALUE_D          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_D_THRESH0_SHIFT_D          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_D						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_D_THRESH1_VALUE_D          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_D_THRESH1_SHIFT_D          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_D_THRESH1_VALUE_D          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_D_THRESH1_SHIFT_D          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_E_TIMESLOT_OFFSET_E        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_E_INPUT_R_SELECT_E         	10			/*Input resistor select*/
#define BITP_TS_CTRL_E_SAMPLE_TYPE_E            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_E_CH2_EN_E                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_E_TIMESLOT_OFFSET_E        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_E_INPUT_R_SELECT_E         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_E_SAMPLE_TYPE_E            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_E_CH2_EN_E                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_E_AFE_PATH_CFG_E           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_E_PRE_WIDTH_E              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_E_AFE_PATH_CFG_E           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_E_PRE_WIDTH_E              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_E_INP12_E                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_E_INP34_E                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_E_INP56_E                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_E_INP78_E                   	12			/*input pair78 enable*/
#define BITM_INPUTS_E_INP12_E                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_E_INP34_E                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_E_INP56_E                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_E_INP78_E                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_E_VC1_SEL_E                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_E_VC1_ALT_E                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_E_VC1_PULSE_E              	4			/*VC1 pulse control*/
#define BITP_CATHODE_E_VC2_SEL_E                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_E_VC2_ALT_E                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_E_VC2_PULSE_E              	10			/*VC2 pulse control*/
#define BITP_CATHODE_E_PRECON_E                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_E_VC1_SEL_E                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_E_VC1_ALT_E                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_E_VC1_PULSE_E              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_E_VC2_SEL_E                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_E_VC2_ALT_E                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_E_VC2_PULSE_E              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_E_PRECON_E                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_TRIM_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_TRIM_E_TIA_GAIN_CH1_E          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_E_TIA_GAIN_CH2_E          	3			/*Tia Resistor gain setting for channel 2*/
#define BITP_AFE_TRIM_E_VREF_PULSE_VAL_E        	6			/*Vref pulse alternate value*/
#define BITP_AFE_TRIM_E_AFE_TRIM_VREF_E         	8			/*Voltage trim for ref buffer*/
#define BITP_AFE_TRIM_E_VREF_PULSE_E            	10			/*Vref pulse control*/
#define BITP_AFE_TRIM_E_AFE_TRIM_INT_E          	11			/*Integrator resistor and capacitor select*/
#define BITM_AFE_TRIM_E_TIA_GAIN_CH1_E          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_E_TIA_GAIN_CH2_E          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_E_VREF_PULSE_VAL_E        	0x00c0		/*Vref pulse alternate value*/
#define BITM_AFE_TRIM_E_AFE_TRIM_VREF_E         	0x0300		/*Voltage trim for ref buffer*/
#define BITM_AFE_TRIM_E_VREF_PULSE_E            	0x0400		/*Vref pulse control*/
#define BITM_AFE_TRIM_E_AFE_TRIM_INT_E          	0xf800		/*Integrator resistor and capacitor select*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW12_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW12_E_LED_CURRENT1_E         	0			/*Led current setting for LED1A or LED1B output*/
#define BITP_LED_POW12_E_LED_DRIVESIDE1_E       	7			/*Led output select for LED1*/
#define BITP_LED_POW12_E_LED_CURRENT2_E         	8			/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_E_LED_DRIVESIDE2_E       	15			/*Led output select for LED2*/
#define BITM_LED_POW12_E_LED_CURRENT1_E         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_E_LED_DRIVESIDE1_E       	0x0080		/*Led output select for LED1*/
#define BITM_LED_POW12_E_LED_CURRENT2_E         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW12_E_LED_DRIVESIDE2_E       	0x8000		/*Led output select for LED2*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_E_LED_CURRENT3_E         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_E_LED_DRIVESIDE3_E       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_E_LED_CURRENT4_E         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_E_LED_DRIVESIDE4_E       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_E_LED_CURRENT3_E         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_E_LED_DRIVESIDE3_E       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_E_LED_CURRENT4_E         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_E_LED_DRIVESIDE4_E       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_E_NUM_REPEAT_E              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_E_NUM_INT_E                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_E_NUM_REPEAT_E              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_E_NUM_INT_E                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_E_MIN_PERIOD_E              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_E_MOD_TYPE_E                	12			/*Modulation Connection type*/
#define BITM_PERIOD_E_MIN_PERIOD_E              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_E_MOD_TYPE_E                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_E_LED_OFFSET_E           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_E_LED_WIDTH_E            	8			/*LED pulse width*/
#define BITM_LED_PULSE_E_LED_OFFSET_E           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_E_LED_WIDTH_E            	0xff00		/*LED pulse width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_E_INTEG_WIDTH_E        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_E_ADC_COUNT_E          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_E_CH1_AMP_DISABLE_E    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_E_AFE_INT_C_BUF_E      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_E_CH2_AMP_DISABLE_E    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_E_SINGLE_INTEG_E       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_E_INTEG_WIDTH_E        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_E_ADC_COUNT_E          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_E_CH1_AMP_DISABLE_E    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_E_AFE_INT_C_BUF_E      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_E_CH2_AMP_DISABLE_E    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_E_SINGLE_INTEG_E       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_E_INTEG_OFFSET_E      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_E_INTEG_FINE_OFFSET_E 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_E_INTEG_OFFSET_E      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_E_INTEG_FINE_OFFSET_E 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_E_MOD_OFFSET_E           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_E_MOD_WIDTH_E            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_E_MOD_OFFSET_E           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_E_MOD_WIDTH_E            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_E_REVERSE_INTEG_E          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_E_SUBTRACT_E               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_E_MOD_DISABLE_E            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_E_LED_DISABLE_E            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_E_REVERSE_INTEG_E          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_E_SUBTRACT_E               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_E_MOD_DISABLE_E            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_E_LED_DISABLE_E            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_E_CH1_ADC_ADJUST_E        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_E_CH1_ADC_ADJUST_E        	0x3fff		/*Adjustment to ADC value.*/

