ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_E_CH2_ADC_ADJUST_E        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_E_CH2_ADC_ADJUST_E        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_E_SIGNAL_SIZE_E              	0			/*Signal data size*/
#define BITP_DATA1_E_SIGNAL_SHIFT_E             	3			/*Signal data shift*/
#define BITP_DATA1_E_DARK_SIZE_E                	8			/*Dark data size*/
#define BITP_DATA1_E_DARK_SHIFT_E               	11			/*Dark data shift*/
#define BITM_DATA1_E_SIGNAL_SIZE_E              	0x0007		/*Signal data size*/
#define BITM_DATA1_E_SIGNAL_SHIFT_E             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_E_DARK_SIZE_E                	0x0700		/*Dark data size*/
#define BITM_DATA1_E_DARK_SHIFT_E               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_E_LIT_SIZE_E                 	0			/*Lit data size*/
#define BITP_DATA2_E_LIT_SHIFT_E                	3			/*Lit data shift*/
#define BITM_DATA2_E_LIT_SIZE_E                 	0x0007		/*Lit data size*/
#define BITM_DATA2_E_LIT_SHIFT_E                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_E_DECIMATE_TYPE_E         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_E_DECIMATE_FACTOR_E       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_E_DECIMATE_TYPE_E         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_E_DECIMATE_FACTOR_E       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_E_LIT_OFFSET_E          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_E_LIT_OFFSET_E          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_E_DARK1_OFFSET_E       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_E_DARK2_OFFSET_E       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_E_DARK1_OFFSET_E       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_E_DARK2_OFFSET_E       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_E_THRESH0_TYPE_E        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_E_THRESH0_DIR_E         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_E_THRESH0_CHAN_E        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_E_THRESH1_TYPE_E        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_E_THRESH1_DIR_E         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_E_THRESH1_CHAN_E        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_E_THRESH0_TYPE_E        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_E_THRESH0_DIR_E         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_E_THRESH0_CHAN_E        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_E_THRESH1_TYPE_E        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_E_THRESH1_DIR_E         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_E_THRESH1_CHAN_E        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_E_THRESH0_VALUE_E          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_E_THRESH0_SHIFT_E          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_E_THRESH0_VALUE_E          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_E_THRESH0_SHIFT_E          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_E						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_E_THRESH1_VALUE_E          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_E_THRESH1_SHIFT_E          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_E_THRESH1_VALUE_E          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_E_THRESH1_SHIFT_E          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_F_TIMESLOT_OFFSET_F        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_F_INPUT_R_SELECT_F         	10			/*Input resistor select*/
#define BITP_TS_CTRL_F_SAMPLE_TYPE_F            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_F_CH2_EN_F                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_F_TIMESLOT_OFFSET_F        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_F_INPUT_R_SELECT_F         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_F_SAMPLE_TYPE_F            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_F_CH2_EN_F                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_F_AFE_PATH_CFG_F           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_F_PRE_WIDTH_F              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_F_AFE_PATH_CFG_F           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_F_PRE_WIDTH_F              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_F_INP12_F                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_F_INP34_F                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_F_INP56_F                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_F_INP78_F                   	12			/*input pair78 enable*/
#define BITM_INPUTS_F_INP12_F                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_F_INP34_F                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_F_INP56_F                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_F_INP78_F                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_F_VC1_SEL_F                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_F_VC1_ALT_F                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_F_VC1_PULSE_F              	4			/*VC1 pulse control*/
#define BITP_CATHODE_F_VC2_SEL_F                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_F_VC2_ALT_F                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_F_VC2_PULSE_F              	10			/*VC2 pulse control*/
#define BITP_CATHODE_F_PRECON_F                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_F_VC1_SEL_F                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_F_VC1_ALT_F                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_F_VC1_PULSE_F              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_F_VC2_SEL_F                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_F_VC2_ALT_F                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_F_VC2_PULSE_F              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_F_PRECON_F                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_TRIM_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_TRIM_F_TIA_GAIN_CH1_F          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_F_TIA_GAIN_CH2_F          	3			/*Tia Resistor gain setting for channel 2*/
#define BITP_AFE_TRIM_F_VREF_PULSE_VAL_F        	6			/*Vref pulse alternate value*/
#define BITP_AFE_TRIM_F_AFE_TRIM_VREF_F         	8			/*Voltage trim for ref buffer*/
#define BITP_AFE_TRIM_F_VREF_PULSE_F            	10			/*Vref pulse control*/
#define BITP_AFE_TRIM_F_AFE_TRIM_INT_F          	11			/*Integrator resistor and capacitor select*/
#define BITM_AFE_TRIM_F_TIA_GAIN_CH1_F          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_F_TIA_GAIN_CH2_F          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_F_VREF_PULSE_VAL_F        	0x00c0		/*Vref pulse alternate value*/
#define BITM_AFE_TRIM_F_AFE_TRIM_VREF_F         	0x0300		/*Voltage trim for ref buffer*/
#define BITM_AFE_TRIM_F_VREF_PULSE_F            	0x0400		/*Vref pulse control*/
#define BITM_AFE_TRIM_F_AFE_TRIM_INT_F          	0xf800		/*Integrator resistor and capacitor select*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW12_F				Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW12_F_LED_CURRENT1_F         	0			/*Led current setting for LED1A or LED1B output*/
#define BITP_LED_POW12_F_LED_DRIVESIDE1_F       	7			/*Led output select for LED1*/
#define BITP_LED_POW12_F_LED_CURRENT2_F         	8			/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_F_LED_DRIVESIDE2_F       	15			/*Led output select for LED2*/
#define BITM_LED_POW12_F_LED_CURRENT1_F         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_F_LED_DRIVESIDE1_F       	0x0080		/*Led output select for LED1*/
#define BITM_LED_POW12_F_LED_CURRENT2_F         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW12_F_LED_DRIVESIDE2_F       	0x8000		/*Led output select for LED2*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_F_LED_CURRENT3_F         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_F_LED_DRIVESIDE3_F       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_F_LED_CURRENT4_F         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_F_LED_DRIVESIDE4_F       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_F_LED_CURRENT3_F         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_F_LED_DRIVESIDE3_F       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_F_LED_CURRENT4_F         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_F_LED_DRIVESIDE4_F       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_F_NUM_REPEAT_F              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_F_NUM_INT_F                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_F_NUM_REPEAT_F              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_F_NUM_INT_F                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_F_MIN_PERIOD_F              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_F_MOD_TYPE_F                	12			/*Modulation Connection type*/
#define BITM_PERIOD_F_MIN_PERIOD_F              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_F_MOD_TYPE_F                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_F_LED_OFFSET_F           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_F_LED_WIDTH_F            	8			/*LED pulse width*/
#define BITM_LED_PULSE_F_LED_OFFSET_F           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_F_LED_WIDTH_F            	0xff00		/*LED pulse width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_F_INTEG_WIDTH_F        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_F_ADC_COUNT_F          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_F_CH1_AMP_DISABLE_F    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_F_AFE_INT_C_BUF_F      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_F_CH2_AMP_DISABLE_F    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_F_SINGLE_INTEG_F       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_F_INTEG_WIDTH_F        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_F_ADC_COUNT_F          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_F_CH1_AMP_DISABLE_F    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_F_AFE_INT_C_BUF_F      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_F_CH2_AMP_DISABLE_F    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_F_SINGLE_INTEG_F       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_F_INTEG_OFFSET_F      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_F_INTEG_FINE_OFFSET_F 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_F_INTEG_OFFSET_F      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_F_INTEG_FINE_OFFSET_F 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_F_MOD_OFFSET_F           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_F_MOD_WIDTH_F            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_F_MOD_OFFSET_F           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_F_MOD_WIDTH_F            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_F_REVERSE_INTEG_F          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_F_SUBTRACT_F               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_F_MOD_DISABLE_F            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_F_LED_DISABLE_F            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_F_REVERSE_INTEG_F          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_F_SUBTRACT_F               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_F_MOD_DISABLE_F            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_F_LED_DISABLE_F            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_F_CH1_ADC_ADJUST_F        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_F_CH1_ADC_ADJUST_F        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_F_CH2_ADC_ADJUST_F        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_F_CH2_ADC_ADJUST_F        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_F_SIGNAL_SIZE_F              	0			/*Signal data size*/
#define BITP_DATA1_F_SIGNAL_SHIFT_F             	3			/*Signal data shift*/
#define BITP_DATA1_F_DARK_SIZE_F                	8			/*Dark data size*/
#define BITP_DATA1_F_DARK_SHIFT_F               	11			/*Dark data shift*/
#define BITM_DATA1_F_SIGNAL_SIZE_F              	0x0007		/*Signal data size*/
#define BITM_DATA1_F_SIGNAL_SHIFT_F             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_F_DARK_SIZE_F                	0x0700		/*Dark data size*/
#define BITM_DATA1_F_DARK_SHIFT_F               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_F_LIT_SIZE_F                 	0			/*Lit data size*/
#define BITP_DATA2_F_LIT_SHIFT_F                	3			/*Lit data shift*/
#define BITM_DATA2_F_LIT_SIZE_F                 	0x0007		/*Lit data size*/
#define BITM_DATA2_F_LIT_SHIFT_F                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_F_DECIMATE_TYPE_F         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_F_DECIMATE_FACTOR_F       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_F_DECIMATE_TYPE_F         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_F_DECIMATE_FACTOR_F       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_F_LIT_OFFSET_F          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_F_LIT_OFFSET_F          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

