ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_F_DARK1_OFFSET_F       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_F_DARK2_OFFSET_F       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_F_DARK1_OFFSET_F       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_F_DARK2_OFFSET_F       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_F_THRESH0_TYPE_F        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_F_THRESH0_DIR_F         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_F_THRESH0_CHAN_F        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_F_THRESH1_TYPE_F        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_F_THRESH1_DIR_F         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_F_THRESH1_CHAN_F        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_F_THRESH0_TYPE_F        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_F_THRESH0_DIR_F         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_F_THRESH0_CHAN_F        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_F_THRESH1_TYPE_F        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_F_THRESH1_DIR_F         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_F_THRESH1_CHAN_F        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_F_THRESH0_VALUE_F          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_F_THRESH0_SHIFT_F          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_F_THRESH0_VALUE_F          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_F_THRESH0_SHIFT_F          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_F						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_F_THRESH1_VALUE_F          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_F_THRESH1_SHIFT_F          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_F_THRESH1_VALUE_F          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_F_THRESH1_SHIFT_F          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_G_TIMESLOT_OFFSET_G        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_G_INPUT_R_SELECT_G         	10			/*Input resistor select*/
#define BITP_TS_CTRL_G_SAMPLE_TYPE_G            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_G_CH2_EN_G                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_G_TIMESLOT_OFFSET_G        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_G_INPUT_R_SELECT_G         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_G_SAMPLE_TYPE_G            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_G_CH2_EN_G                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_G_AFE_PATH_CFG_G           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_G_PRE_WIDTH_G              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_G_AFE_PATH_CFG_G           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_G_PRE_WIDTH_G              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_G_INP12_G                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_G_INP34_G                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_G_INP56_G                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_G_INP78_G                   	12			/*input pair78 enable*/
#define BITM_INPUTS_G_INP12_G                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_G_INP34_G                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_G_INP56_G                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_G_INP78_G                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_G_VC1_SEL_G                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_G_VC1_ALT_G                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_G_VC1_PULSE_G              	4			/*VC1 pulse control*/
#define BITP_CATHODE_G_VC2_SEL_G                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_G_VC2_ALT_G                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_G_VC2_PULSE_G              	10			/*VC2 pulse control*/
#define BITP_CATHODE_G_PRECON_G                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_G_VC1_SEL_G                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_G_VC1_ALT_G                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_G_VC1_PULSE_G              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_G_VC2_SEL_G                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_G_VC2_ALT_G                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_G_VC2_PULSE_G              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_G_PRECON_G                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_TRIM_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_TRIM_G_TIA_GAIN_CH1_G          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_G_TIA_GAIN_CH2_G          	3			/*Tia Resistor gain setting for channel 2*/
#define BITP_AFE_TRIM_G_VREF_PULSE_VAL_G        	6			/*Vref pulse alternate value*/
#define BITP_AFE_TRIM_G_AFE_TRIM_VREF_G         	8			/*Voltage trim for ref buffer*/
#define BITP_AFE_TRIM_G_VREF_PULSE_G            	10			/*Vref pulse control*/
#define BITP_AFE_TRIM_G_AFE_TRIM_INT_G          	11			/*Integrator resistor and capacitor select*/
#define BITM_AFE_TRIM_G_TIA_GAIN_CH1_G          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_G_TIA_GAIN_CH2_G          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_G_VREF_PULSE_VAL_G        	0x00c0		/*Vref pulse alternate value*/
#define BITM_AFE_TRIM_G_AFE_TRIM_VREF_G         	0x0300		/*Voltage trim for ref buffer*/
#define BITM_AFE_TRIM_G_VREF_PULSE_G            	0x0400		/*Vref pulse control*/
#define BITM_AFE_TRIM_G_AFE_TRIM_INT_G          	0xf800		/*Integrator resistor and capacitor select*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW12_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW12_G_LED_CURRENT1_G         	0			/*Led current setting for LED1A or LED1B output*/
#define BITP_LED_POW12_G_LED_DRIVESIDE1_G       	7			/*Led output select for LED1*/
#define BITP_LED_POW12_G_LED_CURRENT2_G         	8			/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_G_LED_DRIVESIDE2_G       	15			/*Led output select for LED2*/
#define BITM_LED_POW12_G_LED_CURRENT1_G         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_G_LED_DRIVESIDE1_G       	0x0080		/*Led output select for LED1*/
#define BITM_LED_POW12_G_LED_CURRENT2_G         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW12_G_LED_DRIVESIDE2_G       	0x8000		/*Led output select for LED2*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_G_LED_CURRENT3_G         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_G_LED_DRIVESIDE3_G       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_G_LED_CURRENT4_G         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_G_LED_DRIVESIDE4_G       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_G_LED_CURRENT3_G         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_G_LED_DRIVESIDE3_G       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_G_LED_CURRENT4_G         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_G_LED_DRIVESIDE4_G       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_G_NUM_REPEAT_G              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_G_NUM_INT_G                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_G_NUM_REPEAT_G              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_G_NUM_INT_G                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_G_MIN_PERIOD_G              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_G_MOD_TYPE_G                	12			/*Modulation Connection type*/
#define BITM_PERIOD_G_MIN_PERIOD_G              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_G_MOD_TYPE_G                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_G_LED_OFFSET_G           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_G_LED_WIDTH_G            	8			/*LED pulse width*/
#define BITM_LED_PULSE_G_LED_OFFSET_G           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_G_LED_WIDTH_G            	0xff00		/*LED pulse width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_G_INTEG_WIDTH_G        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_G_ADC_COUNT_G          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_G_CH1_AMP_DISABLE_G    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_G_AFE_INT_C_BUF_G      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_G_CH2_AMP_DISABLE_G    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_G_SINGLE_INTEG_G       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_G_INTEG_WIDTH_G        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_G_ADC_COUNT_G          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_G_CH1_AMP_DISABLE_G    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_G_AFE_INT_C_BUF_G      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_G_CH2_AMP_DISABLE_G    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_G_SINGLE_INTEG_G       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_G_INTEG_OFFSET_G      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_G_INTEG_FINE_OFFSET_G 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_G_INTEG_OFFSET_G      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_G_INTEG_FINE_OFFSET_G 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_G_MOD_OFFSET_G           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_G_MOD_WIDTH_G            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_G_MOD_OFFSET_G           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_G_MOD_WIDTH_G            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_G_REVERSE_INTEG_G          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_G_SUBTRACT_G               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_G_MOD_DISABLE_G            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_G_LED_DISABLE_G            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_G_REVERSE_INTEG_G          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_G_SUBTRACT_G               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_G_MOD_DISABLE_G            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_G_LED_DISABLE_G            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_G_CH1_ADC_ADJUST_G        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_G_CH1_ADC_ADJUST_G        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_G_CH2_ADC_ADJUST_G        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_G_CH2_ADC_ADJUST_G        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_G_SIGNAL_SIZE_G              	0			/*Signal data size*/
#define BITP_DATA1_G_SIGNAL_SHIFT_G             	3			/*Signal data shift*/
#define BITP_DATA1_G_DARK_SIZE_G                	8			/*Dark data size*/
#define BITP_DATA1_G_DARK_SHIFT_G               	11			/*Dark data shift*/
#define BITM_DATA1_G_SIGNAL_SIZE_G              	0x0007		/*Signal data size*/
#define BITM_DATA1_G_SIGNAL_SHIFT_G             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_G_DARK_SIZE_G                	0x0700		/*Dark data size*/
#define BITM_DATA1_G_DARK_SHIFT_G               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_G_LIT_SIZE_G                 	0			/*Lit data size*/
#define BITP_DATA2_G_LIT_SHIFT_G                	3			/*Lit data shift*/
#define BITM_DATA2_G_LIT_SIZE_G                 	0x0007		/*Lit data size*/
#define BITM_DATA2_G_LIT_SHIFT_G                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_G_DECIMATE_TYPE_G         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_G_DECIMATE_FACTOR_G       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_G_DECIMATE_TYPE_G         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_G_DECIMATE_FACTOR_G       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_G_LIT_OFFSET_G          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_G_LIT_OFFSET_G          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_G_DARK1_OFFSET_G       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_G_DARK2_OFFSET_G       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_G_DARK1_OFFSET_G       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_G_DARK2_OFFSET_G       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_G_THRESH0_TYPE_G        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_G_THRESH0_DIR_G         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_G_THRESH0_CHAN_G        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_G_THRESH1_TYPE_G        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_G_THRESH1_DIR_G         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_G_THRESH1_CHAN_G        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_G_THRESH0_TYPE_G        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_G_THRESH0_DIR_G         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_G_THRESH0_CHAN_G        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_G_THRESH1_TYPE_G        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_G_THRESH1_DIR_G         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_G_THRESH1_CHAN_G        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_G_THRESH0_VALUE_G          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_G_THRESH0_SHIFT_G          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_G_THRESH0_VALUE_G          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_G_THRESH0_SHIFT_G          	0x1f00		/*Shift for threshold compare level interrupt 0*/

