ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_G						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_G_THRESH1_VALUE_G          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_G_THRESH1_SHIFT_G          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_G_THRESH1_VALUE_G          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_G_THRESH1_SHIFT_G          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_H_TIMESLOT_OFFSET_H        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_H_INPUT_R_SELECT_H         	10			/*Input resistor select*/
#define BITP_TS_CTRL_H_SAMPLE_TYPE_H            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_H_CH2_EN_H                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_H_TIMESLOT_OFFSET_H        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_H_INPUT_R_SELECT_H         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_H_SAMPLE_TYPE_H            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_H_CH2_EN_H                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_H_AFE_PATH_CFG_H           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_H_PRE_WIDTH_H              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_H_AFE_PATH_CFG_H           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_H_PRE_WIDTH_H              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_H_INP12_H                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_H_INP34_H                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_H_INP56_H                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_H_INP78_H                   	12			/*input pair78 enable*/
#define BITM_INPUTS_H_INP12_H                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_H_INP34_H                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_H_INP56_H                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_H_INP78_H                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_H_VC1_SEL_H                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_H_VC1_ALT_H                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_H_VC1_PULSE_H              	4			/*VC1 pulse control*/
#define BITP_CATHODE_H_VC2_SEL_H                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_H_VC2_ALT_H                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_H_VC2_PULSE_H              	10			/*VC2 pulse control*/
#define BITP_CATHODE_H_PRECON_H                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_H_VC1_SEL_H                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_H_VC1_ALT_H                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_H_VC1_PULSE_H              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_H_VC2_SEL_H                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_H_VC2_ALT_H                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_H_VC2_PULSE_H              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_H_PRECON_H                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_TRIM_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_TRIM_H_TIA_GAIN_CH1_H          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_H_TIA_GAIN_CH2_H          	3			/*Tia Resistor gain setting for channel 2*/
#define BITP_AFE_TRIM_H_VREF_PULSE_VAL_H        	6			/*Vref pulse alternate value*/
#define BITP_AFE_TRIM_H_AFE_TRIM_VREF_H         	8			/*Voltage trim for ref buffer*/
#define BITP_AFE_TRIM_H_VREF_PULSE_H            	10			/*Vref pulse control*/
#define BITP_AFE_TRIM_H_AFE_TRIM_INT_H          	11			/*Integrator resistor and capacitor select*/
#define BITM_AFE_TRIM_H_TIA_GAIN_CH1_H          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_H_TIA_GAIN_CH2_H          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_H_VREF_PULSE_VAL_H        	0x00c0		/*Vref pulse alternate value*/
#define BITM_AFE_TRIM_H_AFE_TRIM_VREF_H         	0x0300		/*Voltage trim for ref buffer*/
#define BITM_AFE_TRIM_H_VREF_PULSE_H            	0x0400		/*Vref pulse control*/
#define BITM_AFE_TRIM_H_AFE_TRIM_INT_H          	0xf800		/*Integrator resistor and capacitor select*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW12_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW12_H_LED_CURRENT1_H         	0			/*Led current setting for LED1A or LED1B output*/
#define BITP_LED_POW12_H_LED_DRIVESIDE1_H       	7			/*Led output select for LED1*/
#define BITP_LED_POW12_H_LED_CURRENT2_H         	8			/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_H_LED_DRIVESIDE2_H       	15			/*Led output select for LED2*/
#define BITM_LED_POW12_H_LED_CURRENT1_H         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_H_LED_DRIVESIDE1_H       	0x0080		/*Led output select for LED1*/
#define BITM_LED_POW12_H_LED_CURRENT2_H         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW12_H_LED_DRIVESIDE2_H       	0x8000		/*Led output select for LED2*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_H_LED_CURRENT3_H         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_H_LED_DRIVESIDE3_H       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_H_LED_CURRENT4_H         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_H_LED_DRIVESIDE4_H       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_H_LED_CURRENT3_H         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_H_LED_DRIVESIDE3_H       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_H_LED_CURRENT4_H         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_H_LED_DRIVESIDE4_H       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_H_NUM_REPEAT_H              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_H_NUM_INT_H                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_H_NUM_REPEAT_H              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_H_NUM_INT_H                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_H_MIN_PERIOD_H              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_H_MOD_TYPE_H                	12			/*Modulation Connection type*/
#define BITM_PERIOD_H_MIN_PERIOD_H              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_H_MOD_TYPE_H                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_H_LED_OFFSET_H           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_H_LED_WIDTH_H            	8			/*LED pulse width*/
#define BITM_LED_PULSE_H_LED_OFFSET_H           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_H_LED_WIDTH_H            	0xff00		/*LED pulse width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_H_INTEG_WIDTH_H        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_H_ADC_COUNT_H          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_H_CH1_AMP_DISABLE_H    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_H_AFE_INT_C_BUF_H      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_H_CH2_AMP_DISABLE_H    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_H_SINGLE_INTEG_H       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_H_INTEG_WIDTH_H        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_H_ADC_COUNT_H          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_H_CH1_AMP_DISABLE_H    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_H_AFE_INT_C_BUF_H      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_H_CH2_AMP_DISABLE_H    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_H_SINGLE_INTEG_H       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_H_INTEG_OFFSET_H      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_H_INTEG_FINE_OFFSET_H 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_H_INTEG_OFFSET_H      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_H_INTEG_FINE_OFFSET_H 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_H_MOD_OFFSET_H           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_H_MOD_WIDTH_H            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_H_MOD_OFFSET_H           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_H_MOD_WIDTH_H            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_H_REVERSE_INTEG_H          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_H_SUBTRACT_H               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_H_MOD_DISABLE_H            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_H_LED_DISABLE_H            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_H_REVERSE_INTEG_H          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_H_SUBTRACT_H               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_H_MOD_DISABLE_H            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_H_LED_DISABLE_H            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_H_CH1_ADC_ADJUST_H        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_H_CH1_ADC_ADJUST_H        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_H_CH2_ADC_ADJUST_H        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_H_CH2_ADC_ADJUST_H        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_H_SIGNAL_SIZE_H              	0			/*Signal data size*/
#define BITP_DATA1_H_SIGNAL_SHIFT_H             	3			/*Signal data shift*/
#define BITP_DATA1_H_DARK_SIZE_H                	8			/*Dark data size*/
#define BITP_DATA1_H_DARK_SHIFT_H               	11			/*Dark data shift*/
#define BITM_DATA1_H_SIGNAL_SIZE_H              	0x0007		/*Signal data size*/
#define BITM_DATA1_H_SIGNAL_SHIFT_H             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_H_DARK_SIZE_H                	0x0700		/*Dark data size*/
#define BITM_DATA1_H_DARK_SHIFT_H               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_H_LIT_SIZE_H                 	0			/*Lit data size*/
#define BITP_DATA2_H_LIT_SHIFT_H                	3			/*Lit data shift*/
#define BITM_DATA2_H_LIT_SIZE_H                 	0x0007		/*Lit data size*/
#define BITM_DATA2_H_LIT_SHIFT_H                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_H_DECIMATE_TYPE_H         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_H_DECIMATE_FACTOR_H       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_H_DECIMATE_TYPE_H         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_H_DECIMATE_FACTOR_H       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_H_LIT_OFFSET_H          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_H_LIT_OFFSET_H          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_H_DARK1_OFFSET_H       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_H_DARK2_OFFSET_H       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_H_DARK1_OFFSET_H       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_H_DARK2_OFFSET_H       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_H_THRESH0_TYPE_H        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_H_THRESH0_DIR_H         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_H_THRESH0_CHAN_H        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_H_THRESH1_TYPE_H        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_H_THRESH1_DIR_H         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_H_THRESH1_CHAN_H        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_H_THRESH0_TYPE_H        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_H_THRESH0_DIR_H         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_H_THRESH0_CHAN_H        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_H_THRESH1_TYPE_H        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_H_THRESH1_DIR_H         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_H_THRESH1_CHAN_H        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_H_THRESH0_VALUE_H          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_H_THRESH0_SHIFT_H          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_H_THRESH0_VALUE_H          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_H_THRESH0_SHIFT_H          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_H						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_H_THRESH1_VALUE_H          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_H_THRESH1_SHIFT_H          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_H_THRESH1_VALUE_H          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_H_THRESH1_SHIFT_H          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_I_TIMESLOT_OFFSET_I        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_I_INPUT_R_SELECT_I         	10			/*Input resistor select*/
#define BITP_TS_CTRL_I_SAMPLE_TYPE_I            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_I_CH2_EN_I                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_I_TIMESLOT_OFFSET_I        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_I_INPUT_R_SELECT_I         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_I_SAMPLE_TYPE_I            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_I_CH2_EN_I                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_I_AFE_PATH_CFG_I           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_I_PRE_WIDTH_I              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_I_AFE_PATH_CFG_I           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_I_PRE_WIDTH_I              	0xf000		/*Precondition duration for this timeslot.*/

