ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_I_INP12_I                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_I_INP34_I                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_I_INP56_I                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_I_INP78_I                   	12			/*input pair78 enable*/
#define BITM_INPUTS_I_INP12_I                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_I_INP34_I                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_I_INP56_I                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_I_INP78_I                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_I_VC1_SEL_I                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_I_VC1_ALT_I                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_I_VC1_PULSE_I              	4			/*VC1 pulse control*/
#define BITP_CATHODE_I_VC2_SEL_I                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_I_VC2_ALT_I                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_I_VC2_PULSE_I              	10			/*VC2 pulse control*/
#define BITP_CATHODE_I_PRECON_I                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_I_VC1_SEL_I                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_I_VC1_ALT_I                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_I_VC1_PULSE_I              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_I_VC2_SEL_I                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_I_VC2_ALT_I                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_I_VC2_PULSE_I              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_I_PRECON_I                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_TRIM_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_TRIM_I_TIA_GAIN_CH1_I          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_I_TIA_GAIN_CH2_I          	3			/*Tia Resistor gain setting for channel 2*/
#define BITP_AFE_TRIM_I_VREF_PULSE_VAL_I        	6			/*Vref pulse alternate value*/
#define BITP_AFE_TRIM_I_AFE_TRIM_VREF_I         	8			/*Voltage trim for ref buffer*/
#define BITP_AFE_TRIM_I_VREF_PULSE_I            	10			/*Vref pulse control*/
#define BITP_AFE_TRIM_I_AFE_TRIM_INT_I          	11			/*Integrator resistor and capacitor select*/
#define BITM_AFE_TRIM_I_TIA_GAIN_CH1_I          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_I_TIA_GAIN_CH2_I          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_I_VREF_PULSE_VAL_I        	0x00c0		/*Vref pulse alternate value*/
#define BITM_AFE_TRIM_I_AFE_TRIM_VREF_I         	0x0300		/*Voltage trim for ref buffer*/
#define BITM_AFE_TRIM_I_VREF_PULSE_I            	0x0400		/*Vref pulse control*/
#define BITM_AFE_TRIM_I_AFE_TRIM_INT_I          	0xf800		/*Integrator resistor and capacitor select*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW12_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW12_I_LED_CURRENT1_I         	0			/*Led current setting for LED1A or LED1B output*/
#define BITP_LED_POW12_I_LED_DRIVESIDE1_I       	7			/*Led output select for LED1*/
#define BITP_LED_POW12_I_LED_CURRENT2_I         	8			/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_I_LED_DRIVESIDE2_I       	15			/*Led output select for LED2*/
#define BITM_LED_POW12_I_LED_CURRENT1_I         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_I_LED_DRIVESIDE1_I       	0x0080		/*Led output select for LED1*/
#define BITM_LED_POW12_I_LED_CURRENT2_I         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW12_I_LED_DRIVESIDE2_I       	0x8000		/*Led output select for LED2*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_I_LED_CURRENT3_I         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_I_LED_DRIVESIDE3_I       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_I_LED_CURRENT4_I         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_I_LED_DRIVESIDE4_I       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_I_LED_CURRENT3_I         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_I_LED_DRIVESIDE3_I       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_I_LED_CURRENT4_I         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_I_LED_DRIVESIDE4_I       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_I_NUM_REPEAT_I              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_I_NUM_INT_I                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_I_NUM_REPEAT_I              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_I_NUM_INT_I                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_I_MIN_PERIOD_I              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_I_MOD_TYPE_I                	12			/*Modulation Connection type*/
#define BITM_PERIOD_I_MIN_PERIOD_I              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_I_MOD_TYPE_I                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_I_LED_OFFSET_I           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_I_LED_WIDTH_I            	8			/*LED pulse width*/
#define BITM_LED_PULSE_I_LED_OFFSET_I           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_I_LED_WIDTH_I            	0xff00		/*LED pulse width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_I_INTEG_WIDTH_I        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_I_ADC_COUNT_I          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_I_CH1_AMP_DISABLE_I    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_I_AFE_INT_C_BUF_I      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_I_CH2_AMP_DISABLE_I    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_I_SINGLE_INTEG_I       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_I_INTEG_WIDTH_I        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_I_ADC_COUNT_I          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_I_CH1_AMP_DISABLE_I    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_I_AFE_INT_C_BUF_I      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_I_CH2_AMP_DISABLE_I    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_I_SINGLE_INTEG_I       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_I_INTEG_OFFSET_I      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_I_INTEG_FINE_OFFSET_I 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_I_INTEG_OFFSET_I      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_I_INTEG_FINE_OFFSET_I 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_I_MOD_OFFSET_I           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_I_MOD_WIDTH_I            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_I_MOD_OFFSET_I           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_I_MOD_WIDTH_I            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_I_REVERSE_INTEG_I          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_I_SUBTRACT_I               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_I_MOD_DISABLE_I            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_I_LED_DISABLE_I            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_I_REVERSE_INTEG_I          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_I_SUBTRACT_I               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_I_MOD_DISABLE_I            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_I_LED_DISABLE_I            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_I_CH1_ADC_ADJUST_I        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_I_CH1_ADC_ADJUST_I        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_I_CH2_ADC_ADJUST_I        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_I_CH2_ADC_ADJUST_I        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_I_SIGNAL_SIZE_I              	0			/*Signal data size*/
#define BITP_DATA1_I_SIGNAL_SHIFT_I             	3			/*Signal data shift*/
#define BITP_DATA1_I_DARK_SIZE_I                	8			/*Dark data size*/
#define BITP_DATA1_I_DARK_SHIFT_I               	11			/*Dark data shift*/
#define BITM_DATA1_I_SIGNAL_SIZE_I              	0x0007		/*Signal data size*/
#define BITM_DATA1_I_SIGNAL_SHIFT_I             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_I_DARK_SIZE_I                	0x0700		/*Dark data size*/
#define BITM_DATA1_I_DARK_SHIFT_I               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_I_LIT_SIZE_I                 	0			/*Lit data size*/
#define BITP_DATA2_I_LIT_SHIFT_I                	3			/*Lit data shift*/
#define BITM_DATA2_I_LIT_SIZE_I                 	0x0007		/*Lit data size*/
#define BITM_DATA2_I_LIT_SHIFT_I                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_I_DECIMATE_TYPE_I         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_I_DECIMATE_FACTOR_I       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_I_DECIMATE_TYPE_I         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_I_DECIMATE_FACTOR_I       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_I_LIT_OFFSET_I          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_I_LIT_OFFSET_I          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_I_DARK1_OFFSET_I       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_I_DARK2_OFFSET_I       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_I_DARK1_OFFSET_I       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_I_DARK2_OFFSET_I       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_I_THRESH0_TYPE_I        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_I_THRESH0_DIR_I         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_I_THRESH0_CHAN_I        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_I_THRESH1_TYPE_I        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_I_THRESH1_DIR_I         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_I_THRESH1_CHAN_I        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_I_THRESH0_TYPE_I        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_I_THRESH0_DIR_I         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_I_THRESH0_CHAN_I        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_I_THRESH1_TYPE_I        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_I_THRESH1_DIR_I         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_I_THRESH1_CHAN_I        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_I_THRESH0_VALUE_I          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_I_THRESH0_SHIFT_I          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_I_THRESH0_VALUE_I          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_I_THRESH0_SHIFT_I          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_I						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_I_THRESH1_VALUE_I          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_I_THRESH1_SHIFT_I          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_I_THRESH1_VALUE_I          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_I_THRESH1_SHIFT_I          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_J_TIMESLOT_OFFSET_J        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_J_INPUT_R_SELECT_J         	10			/*Input resistor select*/
#define BITP_TS_CTRL_J_SAMPLE_TYPE_J            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_J_CH2_EN_J                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_J_TIMESLOT_OFFSET_J        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_J_INPUT_R_SELECT_J         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_J_SAMPLE_TYPE_J            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_J_CH2_EN_J                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_J_AFE_PATH_CFG_J           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_J_PRE_WIDTH_J              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_J_AFE_PATH_CFG_J           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_J_PRE_WIDTH_J              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_J_INP12_J                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_J_INP34_J                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_J_INP56_J                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_J_INP78_J                   	12			/*input pair78 enable*/
#define BITM_INPUTS_J_INP12_J                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_J_INP34_J                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_J_INP56_J                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_J_INP78_J                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_J						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_J_VC1_SEL_J                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_J_VC1_ALT_J                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_J_VC1_PULSE_J              	4			/*VC1 pulse control*/
#define BITP_CATHODE_J_VC2_SEL_J                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_J_VC2_ALT_J                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_J_VC2_PULSE_J              	10			/*VC2 pulse control*/
#define BITP_CATHODE_J_PRECON_J                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_J_VC1_SEL_J                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_J_VC1_ALT_J                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_J_VC1_PULSE_J              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_J_VC2_SEL_J                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_J_VC2_ALT_J                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_J_VC2_PULSE_J              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_J_PRECON_J                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

