ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_K_LED_CURRENT3_K         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_K_LED_DRIVESIDE3_K       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_K_LED_CURRENT4_K         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_K_LED_DRIVESIDE4_K       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_K_LED_CURRENT3_K         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_K_LED_DRIVESIDE3_K       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_K_LED_CURRENT4_K         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_K_LED_DRIVESIDE4_K       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_K_NUM_REPEAT_K              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_K_NUM_INT_K                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_K_NUM_REPEAT_K              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_K_NUM_INT_K                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_K_MIN_PERIOD_K              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_K_MOD_TYPE_K                	12			/*Modulation Connection type*/
#define BITM_PERIOD_K_MIN_PERIOD_K              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_K_MOD_TYPE_K                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_K_LED_OFFSET_K           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_K_LED_WIDTH_K            	8			/*LED pulse width*/
#define BITM_LED_PULSE_K_LED_OFFSET_K           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_K_LED_WIDTH_K            	0xff00		/*LED pulse width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_K_INTEG_WIDTH_K        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_K_ADC_COUNT_K          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_K_CH1_AMP_DISABLE_K    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_K_AFE_INT_C_BUF_K      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_K_CH2_AMP_DISABLE_K    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_K_SINGLE_INTEG_K       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_K_INTEG_WIDTH_K        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_K_ADC_COUNT_K          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_K_CH1_AMP_DISABLE_K    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_K_AFE_INT_C_BUF_K      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_K_CH2_AMP_DISABLE_K    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_K_SINGLE_INTEG_K       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_K_INTEG_OFFSET_K      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_K_INTEG_FINE_OFFSET_K 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_K_INTEG_OFFSET_K      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_K_INTEG_FINE_OFFSET_K 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_K_MOD_OFFSET_K           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_K_MOD_WIDTH_K            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_K_MOD_OFFSET_K           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_K_MOD_WIDTH_K            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_K_REVERSE_INTEG_K          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_K_SUBTRACT_K               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_K_MOD_DISABLE_K            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_K_LED_DISABLE_K            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_K_REVERSE_INTEG_K          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_K_SUBTRACT_K               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_K_MOD_DISABLE_K            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_K_LED_DISABLE_K            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_K_CH1_ADC_ADJUST_K        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_K_CH1_ADC_ADJUST_K        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_K_CH2_ADC_ADJUST_K        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_K_CH2_ADC_ADJUST_K        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_K_SIGNAL_SIZE_K              	0			/*Signal data size*/
#define BITP_DATA1_K_SIGNAL_SHIFT_K             	3			/*Signal data shift*/
#define BITP_DATA1_K_DARK_SIZE_K                	8			/*Dark data size*/
#define BITP_DATA1_K_DARK_SHIFT_K               	11			/*Dark data shift*/
#define BITM_DATA1_K_SIGNAL_SIZE_K              	0x0007		/*Signal data size*/
#define BITM_DATA1_K_SIGNAL_SHIFT_K             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_K_DARK_SIZE_K                	0x0700		/*Dark data size*/
#define BITM_DATA1_K_DARK_SHIFT_K               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_K_LIT_SIZE_K                 	0			/*Lit data size*/
#define BITP_DATA2_K_LIT_SHIFT_K                	3			/*Lit data shift*/
#define BITM_DATA2_K_LIT_SIZE_K                 	0x0007		/*Lit data size*/
#define BITM_DATA2_K_LIT_SHIFT_K                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_K_DECIMATE_TYPE_K         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_K_DECIMATE_FACTOR_K       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_K_DECIMATE_TYPE_K         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_K_DECIMATE_FACTOR_K       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_K_LIT_OFFSET_K          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_K_LIT_OFFSET_K          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_K_DARK1_OFFSET_K       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_K_DARK2_OFFSET_K       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_K_DARK1_OFFSET_K       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_K_DARK2_OFFSET_K       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_K_THRESH0_TYPE_K        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_K_THRESH0_DIR_K         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_K_THRESH0_CHAN_K        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_K_THRESH1_TYPE_K        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_K_THRESH1_DIR_K         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_K_THRESH1_CHAN_K        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_K_THRESH0_TYPE_K        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_K_THRESH0_DIR_K         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_K_THRESH0_CHAN_K        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_K_THRESH1_TYPE_K        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_K_THRESH1_DIR_K         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_K_THRESH1_CHAN_K        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_K_THRESH0_VALUE_K          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_K_THRESH0_SHIFT_K          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_K_THRESH0_VALUE_K          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_K_THRESH0_SHIFT_K          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_K						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_K_THRESH1_VALUE_K          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_K_THRESH1_SHIFT_K          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_K_THRESH1_VALUE_K          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_K_THRESH1_SHIFT_K          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_CTRL_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_CTRL_L_TIMESLOT_OFFSET_L        	0			/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITP_TS_CTRL_L_INPUT_R_SELECT_L         	10			/*Input resistor select*/
#define BITP_TS_CTRL_L_SAMPLE_TYPE_L            	12			/*Timeslot Sampling Type*/
#define BITP_TS_CTRL_L_CH2_EN_L                 	14			/*Channel 2 enable*/
#define BITM_TS_CTRL_L_TIMESLOT_OFFSET_L        	0x03ff		/*Timeslot A Offset in 64* lfosc1m or 2*lfosc32k cycles.*/
#define BITM_TS_CTRL_L_INPUT_R_SELECT_L         	0x0c00		/*Input resistor select*/
#define BITM_TS_CTRL_L_SAMPLE_TYPE_L            	0x3000		/*Timeslot Sampling Type*/
#define BITM_TS_CTRL_L_CH2_EN_L                 	0x4000		/*Channel 2 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_TS_PATH_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TS_PATH_L_AFE_PATH_CFG_L           	0			/*Bypass and input mux select*/
#define BITP_TS_PATH_L_PRE_WIDTH_L              	12			/*Precondition duration for this timeslot.*/
#define BITM_TS_PATH_L_AFE_PATH_CFG_L           	0x01ff		/*Bypass and input mux select*/
#define BITM_TS_PATH_L_PRE_WIDTH_L              	0xf000		/*Precondition duration for this timeslot.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INPUTS_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INPUTS_L_INP12_L                   	0			/*Input pair12 enable*/
#define BITP_INPUTS_L_INP34_L                   	4			/*Input pair34 enable*/
#define BITP_INPUTS_L_INP56_L                   	8			/*Input pair56 enable*/
#define BITP_INPUTS_L_INP78_L                   	12			/*input pair78 enable*/
#define BITM_INPUTS_L_INP12_L                   	0x000f		/*Input pair12 enable*/
#define BITM_INPUTS_L_INP34_L                   	0x00f0		/*Input pair34 enable*/
#define BITM_INPUTS_L_INP56_L                   	0x0f00		/*Input pair56 enable*/
#define BITM_INPUTS_L_INP78_L                   	0xf000		/*input pair78 enable*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_CATHODE_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CATHODE_L_VC1_SEL_L                	0			/*VC1 active state for this timeslot*/
#define BITP_CATHODE_L_VC1_ALT_L                	2			/*VC1 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_L_VC1_PULSE_L              	4			/*VC1 pulse control*/
#define BITP_CATHODE_L_VC2_SEL_L                	6			/*VC2 active state for this timeslot*/
#define BITP_CATHODE_L_VC2_ALT_L                	8			/*VC2 alternate pulsed state for this timeslot*/
#define BITP_CATHODE_L_VC2_PULSE_L              	10			/*VC2 pulse control*/
#define BITP_CATHODE_L_PRECON_L                 	12			/*Precondition value for enabled inputs during this timeslot*/
#define BITM_CATHODE_L_VC1_SEL_L                	0x0003		/*VC1 active state for this timeslot*/
#define BITM_CATHODE_L_VC1_ALT_L                	0x000c		/*VC1 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_L_VC1_PULSE_L              	0x0030		/*VC1 pulse control*/
#define BITM_CATHODE_L_VC2_SEL_L                	0x00c0		/*VC2 active state for this timeslot*/
#define BITM_CATHODE_L_VC2_ALT_L                	0x0300		/*VC2 alternate pulsed state for this timeslot*/
#define BITM_CATHODE_L_VC2_PULSE_L              	0x0c00		/*VC2 pulse control*/
#define BITM_CATHODE_L_PRECON_L                 	0x7000		/*Precondition value for enabled inputs during this timeslot*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_AFE_TRIM_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_AFE_TRIM_L_TIA_GAIN_CH1_L          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_L_TIA_GAIN_CH2_L          	3			/*Tia Resistor gain setting for channel 2*/
#define BITP_AFE_TRIM_L_VREF_PULSE_VAL_L        	6			/*Vref pulse alternate value*/
#define BITP_AFE_TRIM_L_AFE_TRIM_VREF_L         	8			/*Voltage trim for ref buffer*/
#define BITP_AFE_TRIM_L_VREF_PULSE_L            	10			/*Vref pulse control*/
#define BITP_AFE_TRIM_L_AFE_TRIM_INT_L          	11			/*Integrator resistor and capacitor select*/
#define BITM_AFE_TRIM_L_TIA_GAIN_CH1_L          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_L_TIA_GAIN_CH2_L          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_L_VREF_PULSE_VAL_L        	0x00c0		/*Vref pulse alternate value*/
#define BITM_AFE_TRIM_L_AFE_TRIM_VREF_L         	0x0300		/*Voltage trim for ref buffer*/
#define BITM_AFE_TRIM_L_VREF_PULSE_L            	0x0400		/*Vref pulse control*/
#define BITM_AFE_TRIM_L_AFE_TRIM_INT_L          	0xf800		/*Integrator resistor and capacitor select*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW12_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW12_L_LED_CURRENT1_L         	0			/*Led current setting for LED1A or LED1B output*/
#define BITP_LED_POW12_L_LED_DRIVESIDE1_L       	7			/*Led output select for LED1*/
#define BITP_LED_POW12_L_LED_CURRENT2_L         	8			/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_L_LED_DRIVESIDE2_L       	15			/*Led output select for LED2*/
#define BITM_LED_POW12_L_LED_CURRENT1_L         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_L_LED_DRIVESIDE1_L       	0x0080		/*Led output select for LED1*/
#define BITM_LED_POW12_L_LED_CURRENT2_L         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW12_L_LED_DRIVESIDE2_L       	0x8000		/*Led output select for LED2*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_POW34_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_POW34_L_LED_CURRENT3_L         	0			/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_L_LED_DRIVESIDE3_L       	7			/*Led output select for LED3*/
#define BITP_LED_POW34_L_LED_CURRENT4_L         	8			/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_L_LED_DRIVESIDE4_L       	15			/*Led output select for LED4*/
#define BITM_LED_POW34_L_LED_CURRENT3_L         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW34_L_LED_DRIVESIDE3_L       	0x0080		/*Led output select for LED3*/
#define BITM_LED_POW34_L_LED_CURRENT4_L         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITM_LED_POW34_L_LED_DRIVESIDE4_L       	0x8000		/*Led output select for LED4*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_COUNTS_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_COUNTS_L_NUM_REPEAT_L              	0			/*Number of sequence repeats.*/
#define BITP_COUNTS_L_NUM_INT_L                 	8			/*Number of ADC cycles or acquisition width*/
#define BITM_COUNTS_L_NUM_REPEAT_L              	0x00ff		/*Number of sequence repeats.*/
#define BITM_COUNTS_L_NUM_INT_L                 	0xff00		/*Number of ADC cycles or acquisition width*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PERIOD_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PERIOD_L_MIN_PERIOD_L              	0			/*Minimum Period for pulse repetition.*/
#define BITP_PERIOD_L_MOD_TYPE_L                	12			/*Modulation Connection type*/
#define BITM_PERIOD_L_MIN_PERIOD_L              	0x03ff		/*Minimum Period for pulse repetition.*/
#define BITM_PERIOD_L_MOD_TYPE_L                	0x3000		/*Modulation Connection type*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_LED_PULSE_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_LED_PULSE_L_LED_OFFSET_L           	0			/*LED pulse offset*/
#define BITP_LED_PULSE_L_LED_WIDTH_L            	8			/*LED pulse width*/
#define BITM_LED_PULSE_L_LED_OFFSET_L           	0x00ff		/*LED pulse offset*/
#define BITM_LED_PULSE_L_LED_WIDTH_L            	0xff00		/*LED pulse width*/

