ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd400x_reg.h
/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_WIDTH_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_WIDTH_L_INTEG_WIDTH_L        	0			/*Integrator clock width*/
#define BITP_INTEG_WIDTH_L_ADC_COUNT_L          	6			/*ADC conversions per pulse*/
#define BITP_INTEG_WIDTH_L_CH1_AMP_DISABLE_L    	8			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_L_AFE_INT_C_BUF_L      	11			/*Convert integrator to buffer*/
#define BITP_INTEG_WIDTH_L_CH2_AMP_DISABLE_L    	12			/*Amplifier disables for power control*/
#define BITP_INTEG_WIDTH_L_SINGLE_INTEG_L       	15			/*Use single integrator pulse*/
#define BITM_INTEG_WIDTH_L_INTEG_WIDTH_L        	0x001f		/*Integrator clock width*/
#define BITM_INTEG_WIDTH_L_ADC_COUNT_L          	0x00c0		/*ADC conversions per pulse*/
#define BITM_INTEG_WIDTH_L_CH1_AMP_DISABLE_L    	0x0700		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_L_AFE_INT_C_BUF_L      	0x0800		/*Convert integrator to buffer*/
#define BITM_INTEG_WIDTH_L_CH2_AMP_DISABLE_L    	0x7000		/*Amplifier disables for power control*/
#define BITM_INTEG_WIDTH_L_SINGLE_INTEG_L       	0x8000		/*Use single integrator pulse*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_INTEG_OFFSET_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_INTEG_OFFSET_L_INTEG_OFFSET_L      	0			/*Integrator clock coarse offset*/
#define BITP_INTEG_OFFSET_L_INTEG_FINE_OFFSET_L 	8			/*Integrator clock fine offset*/
#define BITM_INTEG_OFFSET_L_INTEG_OFFSET_L      	0x00ff		/*Integrator clock coarse offset*/
#define BITM_INTEG_OFFSET_L_INTEG_FINE_OFFSET_L 	0x1f00		/*Integrator clock fine offset*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_MOD_PULSE_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_MOD_PULSE_L_MOD_OFFSET_L           	0			/*modulation pulse offset*/
#define BITP_MOD_PULSE_L_MOD_WIDTH_L            	8			/*modulation pulse width.*/
#define BITM_MOD_PULSE_L_MOD_OFFSET_L           	0x00ff		/*modulation pulse offset*/
#define BITM_MOD_PULSE_L_MOD_WIDTH_L            	0xff00		/*modulation pulse width.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_PATTERN_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_PATTERN_L_REVERSE_INTEG_L          	0			/*4 Pulse integration reverse pattern*/
#define BITP_PATTERN_L_SUBTRACT_L               	4			/*4 Pulse subtract pattern*/
#define BITP_PATTERN_L_MOD_DISABLE_L            	8			/*4 Pulse modulation disable pattern*/
#define BITP_PATTERN_L_LED_DISABLE_L            	12			/*4 Pulse LED disable pattern*/
#define BITM_PATTERN_L_REVERSE_INTEG_L          	0x000f		/*4 Pulse integration reverse pattern*/
#define BITM_PATTERN_L_SUBTRACT_L               	0x00f0		/*4 Pulse subtract pattern*/
#define BITM_PATTERN_L_MOD_DISABLE_L            	0x0f00		/*4 Pulse modulation disable pattern*/
#define BITM_PATTERN_L_LED_DISABLE_L            	0xf000		/*4 Pulse LED disable pattern*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF1_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF1_L_CH1_ADC_ADJUST_L        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF1_L_CH1_ADC_ADJUST_L        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_ADC_OFF2_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_ADC_OFF2_L_CH2_ADC_ADJUST_L        	0			/*Adjustment to ADC value.*/
#define BITM_ADC_OFF2_L_CH2_ADC_ADJUST_L        	0x3fff		/*Adjustment to ADC value.*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA1_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA1_L_SIGNAL_SIZE_L              	0			/*Signal data size*/
#define BITP_DATA1_L_SIGNAL_SHIFT_L             	3			/*Signal data shift*/
#define BITP_DATA1_L_DARK_SIZE_L                	8			/*Dark data size*/
#define BITP_DATA1_L_DARK_SHIFT_L               	11			/*Dark data shift*/
#define BITM_DATA1_L_SIGNAL_SIZE_L              	0x0007		/*Signal data size*/
#define BITM_DATA1_L_SIGNAL_SHIFT_L             	0x00f8		/*Signal data shift*/
#define BITM_DATA1_L_DARK_SIZE_L                	0x0700		/*Dark data size*/
#define BITM_DATA1_L_DARK_SHIFT_L               	0xf800		/*Dark data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DATA2_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DATA2_L_LIT_SIZE_L                 	0			/*Lit data size*/
#define BITP_DATA2_L_LIT_SHIFT_L                	3			/*Lit data shift*/
#define BITM_DATA2_L_LIT_SIZE_L                 	0x0007		/*Lit data size*/
#define BITM_DATA2_L_LIT_SHIFT_L                	0x00f8		/*Lit data shift*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DECIMATE_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DECIMATE_L_DECIMATE_TYPE_L         	0			/*Decimation Type Select*/
#define BITP_DECIMATE_L_DECIMATE_FACTOR_L       	4			/*Decimate Sample Divider (minus 1)*/
#define BITM_DECIMATE_L_DECIMATE_TYPE_L         	0x000f		/*Decimation Type Select*/
#define BITM_DECIMATE_L_DECIMATE_FACTOR_L       	0x07f0		/*Decimate Sample Divider (minus 1)*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_LIT_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_LIT_L_LIT_OFFSET_L          	0			/*Acquisition Window Lit Offset for Timeslot A*/
#define BITM_DIGINT_LIT_L_LIT_OFFSET_L          	0x01ff		/*Acquisition Window Lit Offset for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_DIGINT_DARK_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DIGINT_DARK_L_DARK1_OFFSET_L       	0			/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITP_DIGINT_DARK_L_DARK2_OFFSET_L       	7			/*Acquisition Window Dark Offset 2 for Timeslot A*/
#define BITM_DIGINT_DARK_L_DARK1_OFFSET_L       	0x007f		/*Acquisition Window Dark Offset 1 for Timeslot A*/
#define BITM_DIGINT_DARK_L_DARK2_OFFSET_L       	0xff80		/*Acquisition Window Dark Offset 2 for Timeslot A*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH_CFG_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH_CFG_L_THRESH0_TYPE_L        	0			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_L_THRESH0_DIR_L         	2			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_L_THRESH0_CHAN_L        	3			/*Type of comparison for level interrupt 0*/
#define BITP_THRESH_CFG_L_THRESH1_TYPE_L        	4			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_L_THRESH1_DIR_L         	6			/*Type of comparison for level interrupt 1*/
#define BITP_THRESH_CFG_L_THRESH1_CHAN_L        	7			/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_L_THRESH0_TYPE_L        	0x0003		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_L_THRESH0_DIR_L         	0x0004		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_L_THRESH0_CHAN_L        	0x0008		/*Type of comparison for level interrupt 0*/
#define BITM_THRESH_CFG_L_THRESH1_TYPE_L        	0x0030		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_L_THRESH1_DIR_L         	0x0040		/*Type of comparison for level interrupt 1*/
#define BITM_THRESH_CFG_L_THRESH1_CHAN_L        	0x0080		/*Type of comparison for level interrupt 1*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH0_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH0_L_THRESH0_VALUE_L          	0			/*Value for threshold compare level interrupt 0*/
#define BITP_THRESH0_L_THRESH0_SHIFT_L          	8			/*Shift for threshold compare level interrupt 0*/
#define BITM_THRESH0_L_THRESH0_VALUE_L          	0x00ff		/*Value for threshold compare level interrupt 0*/
#define BITM_THRESH0_L_THRESH0_SHIFT_L          	0x1f00		/*Shift for threshold compare level interrupt 0*/

/* -------------------------------------------------------------------------------------------------------------------------
				REG_THRESH1_L						Pos/Masks						Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_THRESH1_L_THRESH1_VALUE_L          	0			/*Value for threshold compare level interrupt 1*/
#define BITP_THRESH1_L_THRESH1_SHIFT_L          	8			/*Shift for threshold compare level interrupt 1*/
#define BITM_THRESH1_L_THRESH1_VALUE_L          	0x00ff		/*Value for threshold compare level interrupt 1*/
#define BITM_THRESH1_L_THRESH1_SHIFT_L          	0x1f00		/*Shift for threshold compare level interrupt 1*/

/* ---------------------------------------------------------------------------------------------------------------------------
                    FOR VARYING THE SLOT BASED ON REQUEST  - X represents any slot Between A TO L
----------------------------------------------------------------------------------------------------------------------------*/
#define BITP_LED_POW12_X_LED_CURRENT1_X         	0			/*Led current setting for LED1A or LED1B output*/
#define BITM_LED_POW12_X_LED_CURRENT1_X         	0x007f		/*Led current setting for LED1A or LED1B output*/
#define BITP_AFE_TRIM_X_TIA_GAIN_CH1_X          	0			/*Tia Resistor gain setting for channel 1*/
#define BITP_AFE_TRIM_X_TIA_GAIN_CH2_X          	3			/*Tia Resistor gain setting for channel 2*/
#define BITM_AFE_TRIM_X_TIA_GAIN_CH1_X          	0x0007		/*Tia Resistor gain setting for channel 1*/
#define BITM_AFE_TRIM_X_TIA_GAIN_CH2_X          	0x0038		/*Tia Resistor gain setting for channel 2*/
#define BITM_LED_POW34_X_LED_CURRENT3_X         	0x007f		/*Led current setting for LED3A or LED3B output*/
#define BITP_LED_POW34_X_LED_CURRENT3_X         	0			/*Led current setting for LED3A or LED3B output*/
#define BITM_LED_POW12_X_LED_CURRENT2_X         	0x7f00		/*Led current setting for LED2A or LED2B output*/
#define BITP_LED_POW12_X_LED_CURRENT2_X         	8			/*Led current setting for LED2A or LED2B output*/
#define BITM_LED_POW34_X_LED_CURRENT4_X         	0x7f00		/*Led current setting for LED4A or LED4B output*/
#define BITP_LED_POW34_X_LED_CURRENT4_X         	8			/*Led current setting for LED4A or LED4B output*/

#endif //ADPD400x_REG_DEF_H

